Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:JoinedSFRDef edc:nzwidth="0x40" edc:cname="D1" edc:impl="0xFFFFFFFFFFFFFFFF" edc:desc="Floating-Point Extension Register">
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S2" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="156"/>
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S3" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="160"/>
      </edc:JoinedSFRDef>
      <edc:JoinedSFRDef edc:nzwidth="0x40" edc:cname="D2" edc:impl="0xFFFFFFFFFFFFFFFF" edc:desc="Floating-Point Extension Register">
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S4" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="164"/>
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S5" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="168"/>
      </edc:JoinedSFRDef>
      <edc:JoinedSFRDef edc:nzwidth="0x40" edc:cname="D3" edc:impl="0xFFFFFFFFFFFFFFFF" edc:desc="Floating-Point Extension Register">
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S6" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="172"/>
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S7" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="176"/>
      </edc:JoinedSFRDef>
      <edc:JoinedSFRDef edc:nzwidth="0x40" edc:cname="D4" edc:impl="0xFFFFFFFFFFFFFFFF" edc:desc="Floating-Point Extension Register">
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S8" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="180"/>
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S9" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="184"/>
      </edc:JoinedSFRDef>
      <edc:JoinedSFRDef edc:nzwidth="0x40" edc:cname="D5" edc:impl="0xFFFFFFFFFFFFFFFF" edc:desc="Floating-Point Extension Register">
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S10" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="188"/>
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S11" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="192"/>
      </edc:JoinedSFRDef>
      <edc:JoinedSFRDef edc:nzwidth="0x40" edc:cname="D6" edc:impl="0xFFFFFFFFFFFFFFFF" edc:desc="Floating-Point Extension Register">
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S12" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="196"/>
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S13" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="200"/>
      </edc:JoinedSFRDef>
      <edc:JoinedSFRDef edc:nzwidth="0x40" edc:cname="D7" edc:impl="0xFFFFFFFFFFFFFFFF" edc:desc="Floating-Point Extension Register">
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S14" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="204"/>
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S15" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="208"/>
      </edc:JoinedSFRDef>
      <edc:JoinedSFRDef edc:nzwidth="0x40" edc:cname="D8" edc:impl="0xFFFFFFFFFFFFFFFF" edc:desc="Floating-Point Extension Register">
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S16" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="212"/>
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S17" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="216"/>
      </edc:JoinedSFRDef>
      <edc:JoinedSFRDef edc:nzwidth="0x40" edc:cname="D9" edc:impl="0xFFFFFFFFFFFFFFFF" edc:desc="Floating-Point Extension Register">
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S18" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="220"/>
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S19" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="224"/>
      </edc:JoinedSFRDef>
      <edc:JoinedSFRDef edc:nzwidth="0x40" edc:cname="D10" edc:impl="0xFFFFFFFFFFFFFFFF" edc:desc="Floating-Point Extension Register">
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S20" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="228"/>
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S21" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="232"/>
      </edc:JoinedSFRDef>
