Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM7" edc:cname="FLEX_TWI_CWGR" edc:nzwidth="0x20" edc:access="--nnnnnn---n-nnnnnnnnnnnnnnnnnnn" edc:impl="0x3F17FFFF" edc:_addr="0x4001C610">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM7">
            <edc:SFRFieldDef edc:cname="CLDIV" edc:nzwidth="0x8" edc:desc="Clock Low Divider"/>
            <edc:SFRFieldDef edc:cname="CHDIV" edc:nzwidth="0x8" edc:desc="Clock High Divider"/>
            <edc:SFRFieldDef edc:cname="CKDIV" edc:nzwidth="0x3" edc:desc="Clock Divider"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BRSRCCLK" edc:nzwidth="0x1" edc:desc="Bit Rate Source Clock">
              <edc:SFRFieldSemantic edc:cname="PERIPH_CLK" edc:desc="The peripheral clock is the source clock for the bit rate generation." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="HOLD" edc:nzwidth="0x6" edc:desc="TWD Hold Time Versus TWCK Falling"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x4001C614"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM7" edc:cname="FLEX_TWI_SR" edc:nzwidth="0x20" edc:access="-----rrrr-rrrrrrrrrrrrrrrrrrrrrr" edc:impl="0x7BFFFFF" edc:_addr="0x4001C620">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM7">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:nzwidth="0x1" edc:desc="Transmission Completed (cleared by writing FLEX_TWI_THR)"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Holding Register Ready (cleared when reading FLEX_TWI_RHR)"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Holding Register Ready (cleared by writing FLEX_TWI_THR)"/>
            <edc:SFRFieldDef edc:cname="SVREAD" edc:nzwidth="0x1" edc:desc="Client Read"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:nzwidth="0x1" edc:desc="Client Access"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:nzwidth="0x1" edc:desc="General Call Access (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Underrun Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:nzwidth="0x1" edc:desc="Not Acknowledged (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:nzwidth="0x1" edc:desc="Arbitration Lost (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SCLWS" edc:nzwidth="0x1" edc:desc="Clock Wait State"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:nzwidth="0x1" edc:desc="End Of Client Access (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of RX Buffer (cleared by writing FLEX_TWI_RCR or FLEX_TWI_RNCR)"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of TX Buffer (cleared by writing FLEX_TWI_TCR or FLEX_TWI_TNCR)"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="RX Buffer Full (cleared by writing FLEX_TWI_RCR or FLEX_TWI_RNCR)"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="TX Buffer Empty (cleared by writing FLEX_TWI_TCR or FLEX_TWI_TNCR)"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:nzwidth="0x1" edc:desc="Host Code Acknowledge (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SMBAF" edc:nzwidth="0x1" edc:desc="SMBus Alert Flag"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:nzwidth="0x1" edc:desc="Timeout Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:nzwidth="0x1" edc:desc="PEC Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:nzwidth="0x1" edc:desc="SMBus Default Address Match (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:nzwidth="0x1" edc:desc="SMBus Host Header Address Match (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXFLOCK" edc:nzwidth="0x1" edc:desc="Transmit FIFO Lock"/>
            <edc:SFRFieldDef edc:cname="SCL" edc:nzwidth="0x1" edc:desc="SCL Line Value"/>
            <edc:SFRFieldDef edc:cname="SDA" edc:nzwidth="0x1" edc:desc="SDA Line Value"/>
            <edc:SFRFieldDef edc:cname="SR" edc:nzwidth="0x1" edc:desc="Start Repeated"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM7" edc:cname="FLEX_TWI_IER" edc:nzwidth="0x20" edc:access="----------wwww-wwwwwwwwwwwww-www" edc:impl="0x3DFFF7" edc:_addr="0x4001C624">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM7">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:nzwidth="0x1" edc:desc="Transmission Completed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Holding Register Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Holding Register Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:nzwidth="0x1" edc:desc="Client Access Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:nzwidth="0x1" edc:desc="General Call Access Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Underrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:nzwidth="0x1" edc:desc="Not Acknowledge Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:nzwidth="0x1" edc:desc="Arbitration Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SCL_WS" edc:nzwidth="0x1" edc:desc="Clock Wait State Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:nzwidth="0x1" edc:desc="End Of Client Access Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:nzwidth="0x1" edc:desc="Host Code Acknowledge Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:nzwidth="0x1" edc:desc="Timeout Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:nzwidth="0x1" edc:desc="PEC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:nzwidth="0x1" edc:desc="SMBus Default Address Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:nzwidth="0x1" edc:desc="SMBus Host Header Address Match Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM7" edc:cname="FLEX_TWI_IDR" edc:nzwidth="0x20" edc:access="----------wwww-wwwwwwwwwwwww-www" edc:impl="0x3DFFF7" edc:_addr="0x4001C628">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM7">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:nzwidth="0x1" edc:desc="Transmission Completed Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Holding Register Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Holding Register Ready Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:nzwidth="0x1" edc:desc="Client Access Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:nzwidth="0x1" edc:desc="General Call Access Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Underrun Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:nzwidth="0x1" edc:desc="Not Acknowledge Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:nzwidth="0x1" edc:desc="Arbitration Lost Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SCL_WS" edc:nzwidth="0x1" edc:desc="Clock Wait State Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:nzwidth="0x1" edc:desc="End Of Client Access Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:nzwidth="0x1" edc:desc="Host Code Acknowledge Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:nzwidth="0x1" edc:desc="Timeout Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:nzwidth="0x1" edc:desc="PEC Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:nzwidth="0x1" edc:desc="SMBus Default Address Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:nzwidth="0x1" edc:desc="SMBus Host Header Address Match Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM7" edc:cname="FLEX_TWI_IMR" edc:nzwidth="0x20" edc:access="----------rrrr-rrrrrrrrrrrrr-rrr" edc:impl="0x3DFFF7" edc:_addr="0x4001C62C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM7">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:nzwidth="0x1" edc:desc="Transmission Completed Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Holding Register Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Holding Register Ready Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:nzwidth="0x1" edc:desc="Client Access Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:nzwidth="0x1" edc:desc="General Call Access Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Underrun Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:nzwidth="0x1" edc:desc="Not Acknowledge Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:nzwidth="0x1" edc:desc="Arbitration Lost Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="SCL_WS" edc:nzwidth="0x1" edc:desc="Clock Wait State Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:nzwidth="0x1" edc:desc="End Of Client Access Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="MCACK" edc:nzwidth="0x1" edc:desc="Host Code Acknowledge Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:nzwidth="0x1" edc:desc="Timeout Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PECERR" edc:nzwidth="0x1" edc:desc="PEC Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="SMBDAM" edc:nzwidth="0x1" edc:desc="SMBus Default Address Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="SMBHHM" edc:nzwidth="0x1" edc:desc="SMBus Host Header Address Match Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM7" edc:cname="FLEX_TWI_RHR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4001C630">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM7">
            <edc:SFRFieldDef edc:cname="RXDATA0" edc:nzwidth="0x8" edc:desc="Host or Client Receive Holding Data 0"/>
            <edc:SFRFieldDef edc:cname="RXDATA1" edc:nzwidth="0x8" edc:desc="Host or Client Receive Holding Data 1"/>
            <edc:AdjustPoint edc:offset="-6"/>
            <edc:SFRFieldDef edc:cname="PSTATE" edc:nzwidth="0x1" edc:desc="Stop State (Client Sniffer Mode only)"/>
            <edc:SFRFieldDef edc:cname="ASTATE" edc:nzwidth="0x2" edc:desc="Acknowledge State (Client Sniffer Mode only)">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Acknowledge or Nacknowledge detected after previously logged data" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ACK" edc:desc="Acknowledge (A) detected after previously logged data" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NACK" edc:desc="Nacknowledge (NA) detected after previously logged data" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="UNDEF" edc:desc="Not defined" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RXDATA2" edc:nzwidth="0x8" edc:desc="Host or Client Receive Holding Data 2"/>
            <edc:SFRFieldDef edc:cname="RXDATA3" edc:nzwidth="0x8" edc:desc="Host or Client Receive Holding Data 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM7" edc:cname="FLEX_TWI_THR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4001C634">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM7">
            <edc:SFRFieldDef edc:cname="TXDATA0" edc:nzwidth="0x8" edc:desc="Host or Client Transmit Holding Data 0"/>
            <edc:SFRFieldDef edc:cname="TXDATA1" edc:nzwidth="0x8" edc:desc="Host or Client Transmit Holding Data 1"/>
            <edc:SFRFieldDef edc:cname="TXDATA2" edc:nzwidth="0x8" edc:desc="Host or Client Transmit Holding Data 2"/>
            <edc:SFRFieldDef edc:cname="TXDATA3" edc:nzwidth="0x8" edc:desc="Host or Client Transmit Holding Data 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
