Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_TDR" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwwwwwww" edc:impl="0xFFFF" edc:_addr="0x4002000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="TD" edc:nzwidth="0x10" edc:desc="Transmit Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_ISR" edc:nzwidth="0x20" edc:access="--------------r-rrrrrr-rrrrrrrrr" edc:impl="0x2FDFF" edc:_addr="0x40020010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="RDRF" edc:nzwidth="0x1" edc:desc="Receive Data Register Full (cleared by reading QSPI_RDR)"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:nzwidth="0x1" edc:desc="Transmit Data Register Empty (cleared by writing QSPI_TDR)"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmission Registers Empty (cleared by writing QSPI_TDR)"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:nzwidth="0x1" edc:desc="Overrun Error Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of RX buffer"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of TX buffer"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="RX Buffer Full"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="TX Buffer Empty"/>
            <edc:SFRFieldDef edc:cname="CSR" edc:nzwidth="0x1" edc:desc="Chip Select Rise (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INSTRE" edc:nzwidth="0x1" edc:desc="Instruction End Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LWRA" edc:nzwidth="0x1" edc:desc="Last Write Access (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="QITF" edc:nzwidth="0x1" edc:desc="QSPI Interrupt Fall"/>
            <edc:SFRFieldDef edc:cname="QITR" edc:nzwidth="0x1" edc:desc="QSPI Interrupt Rise"/>
            <edc:SFRFieldDef edc:cname="CSFA" edc:nzwidth="0x1" edc:desc="Chip Select Fall Autoclear"/>
            <edc:SFRFieldDef edc:cname="CSRA" edc:nzwidth="0x1" edc:desc="Chip Select Rise Autoclear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:nzwidth="0x1" edc:desc="QSPI Time-out"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_IER" edc:nzwidth="0x20" edc:access="--------------w-wwwwww-wwwwwwwww" edc:impl="0x2FDFF" edc:_addr="0x40020014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="RDRF" edc:nzwidth="0x1" edc:desc="Receive Data Register Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:nzwidth="0x1" edc:desc="Transmit Data Register Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmission Registers Empty Enable"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CSR" edc:nzwidth="0x1" edc:desc="Chip Select Rise Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INSTRE" edc:nzwidth="0x1" edc:desc="Instruction End Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LWRA" edc:nzwidth="0x1" edc:desc="Last Write Access Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="QITF" edc:nzwidth="0x1" edc:desc="QSPI Interrupt Fall Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="QITR" edc:nzwidth="0x1" edc:desc="QSPI Interrupt Rise Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CSFA" edc:nzwidth="0x1" edc:desc="Chip Select Fall Autoclear Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CSRA" edc:nzwidth="0x1" edc:desc="Chip Select Rise Autoclear Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:nzwidth="0x1" edc:desc="QSPI Time-out Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="QSPI" edc:cname="QSPI_IDR" edc:nzwidth="0x20" edc:access="--------------w-wwwwww-wwwwwwwww" edc:impl="0x2FDFF" edc:_addr="0x40020018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="RDRF" edc:nzwidth="0x1" edc:desc="Receive Data Register Full Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:nzwidth="0x1" edc:desc="Transmit Data Register Empty Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmission Registers Empty Disable"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CSR" edc:nzwidth="0x1" edc:desc="Chip Select Rise Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INSTRE" edc:nzwidth="0x1" edc:desc="Instruction End Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LWRA" edc:nzwidth="0x1" edc:desc="Last Write Access Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="QITF" edc:nzwidth="0x1" edc:desc="QSPI Interrupt Fall Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="QITR" edc:nzwidth="0x1" edc:desc="QSPI Interrupt Rise Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CSFA" edc:nzwidth="0x1" edc:desc="Chip Select Fall Autoclear Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CSRA" edc:nzwidth="0x1" edc:desc="Chip Select Rise Autoclear Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TOUT" edc:nzwidth="0x1" edc:desc="QSPI Time-out Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
