Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_EOC_ISR" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0x40024040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion 0 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion 1 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion 2 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion 3 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion 4 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion 5 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion 6 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion 7 (automatically set / cleared)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_TEMPMR" edc:nzwidth="0x20" edc:access="--------------------------nn---n" edc:impl="0x31" edc:_addr="0x40024044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="TEMPON" edc:nzwidth="0x1" edc:desc="Temperature Sensor On"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCMPMOD" edc:nzwidth="0x2" edc:desc="Temperature Comparison Mode">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Generates the TEMPCHG flag in ADC_ISR when the converted data is lower than the low threshold of the window." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Generates the TEMPCHG flag in ADC_ISR when the converted data is higher than the high threshold of the window." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="Generates the TEMPCHG flag in ADC_ISR when the converted data is in the comparison window." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="Generates the TEMPCHG flag in ADC_ISR when the converted data is out of the comparison window." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_TEMPCWR" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:impl="0xFFF0FFF" edc:_addr="0x40024048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="TLOWTHRES" edc:nzwidth="0xC" edc:desc="Temperature Low Threshold"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="THIGHTHRES" edc:nzwidth="0xC" edc:desc="Temperature High Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_OVER" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0x4002404C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="OVRE0" edc:nzwidth="0x1" edc:desc="Overrun Error 0"/>
            <edc:SFRFieldDef edc:cname="OVRE1" edc:nzwidth="0x1" edc:desc="Overrun Error 1"/>
            <edc:SFRFieldDef edc:cname="OVRE2" edc:nzwidth="0x1" edc:desc="Overrun Error 2"/>
            <edc:SFRFieldDef edc:cname="OVRE3" edc:nzwidth="0x1" edc:desc="Overrun Error 3"/>
            <edc:SFRFieldDef edc:cname="OVRE4" edc:nzwidth="0x1" edc:desc="Overrun Error 4"/>
            <edc:SFRFieldDef edc:cname="OVRE5" edc:nzwidth="0x1" edc:desc="Overrun Error 5"/>
            <edc:SFRFieldDef edc:cname="OVRE6" edc:nzwidth="0x1" edc:desc="Overrun Error 6"/>
            <edc:SFRFieldDef edc:cname="OVRE7" edc:nzwidth="0x1" edc:desc="Overrun Error 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_EMR" edc:nzwidth="0x20" edc:access="--nn-nnnnnnn-nnn--nn--nnnnnn-nnn" edc:impl="0x37F733F7" edc:_addr="0x40024050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="CMPMODE" edc:nzwidth="0x2" edc:desc="Comparison Mode">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="When the converted data is lower than the low threshold of the window, generates the COMPE flag in ADC_ISR or, in Partial Wake-up mode, defines the conditions to exit the system from Wait mode." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="When the converted data is higher than the high threshold of the window, generates the COMPE flag in ADC_ISR or, in Partial Wake-up mode, defines the conditions to exit the system from Wait mode." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="When the converted data is in the comparison window, generates the COMPE flag in ADC_ISR or, in Partial Wake-up mode, defines the conditions to exit the system from Wait mode." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="When the converted data is out of the comparison window, generates the COMPE flag in ADC_ISR or, in Partial Wake-up mode, defines the conditions to exit the system from Wait mode." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMPTYPE" edc:nzwidth="0x1" edc:desc="Comparison Type">
              <edc:SFRFieldSemantic edc:cname="FLAG_ONLY" edc:desc="Any conversion is performed and comparison function drives the COMPE flag." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="START_CONDITION" edc:desc="Comparison conditions must be met to start the storage of all conversions until ADC_CR.CMPRST is set." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPSEL" edc:nzwidth="0x5" edc:desc="Comparison Selected Channel"/>
            <edc:SFRFieldDef edc:cname="CMPALL" edc:nzwidth="0x1" edc:desc="Compare All Channels"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMPFILTER" edc:nzwidth="0x2" edc:desc="Compare Event Filtering"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSR" edc:nzwidth="0x3" edc:desc="Over Sampling Rate">
              <edc:SFRFieldSemantic edc:cname="NO_AVERAGE" edc:desc="No averaging. ADC sample rate is maximum." edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="OSR4" edc:desc="1-bit enhanced resolution by averaging. ADC sample rate divided by 4." edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OSR16" edc:desc="2-bit enhanced resolution by averaging. ADC sample rate divided by 16." edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="OSR64" edc:desc="1-bit enhanced resolution by averaging. ADC sample rate divided by 64" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="OSR256" edc:desc="2-bit enhanced resolution by averaging. ADC sample rate divided by 256." edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ASTE" edc:nzwidth="0x1" edc:desc="Averaging on Single Trigger Event">
              <edc:SFRFieldSemantic edc:cname="MULTI_TRIG_AVERAGE" edc:desc="The average requests several trigger events." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE_TRIG_AVERAGE" edc:desc="The average requests only one trigger event." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRCCLK" edc:nzwidth="0x1" edc:desc="External Clock Selection">
              <edc:SFRFieldSemantic edc:cname="PERIPH_CLK" edc:desc="The peripheral clock is the source for the ADC prescaler." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="GCLK is the source clock for the ADC prescaler, thus the ADC clock can be independent of the core/peripheral clock." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRACKX" edc:nzwidth="0x2" edc:desc="Tracking Time x4, x8 or x16">
              <edc:SFRFieldSemantic edc:cname="TRACKTIMX1" edc:desc="ADC_MR.TRACKTIM effect is multiplied by 1." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TRACKTIMX4" edc:desc="ADC_MR.TRACKTIM effect is multiplied by 4." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="TRACKTIMX8" edc:desc="ADC_MR.TRACKTIM effect is multiplied by 8" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TRACKTIMX16" edc:desc="ADC_MR.TRACKTIM effect is multiplied by 16." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TAG" edc:nzwidth="0x1" edc:desc="ADC_LCDR Tag"/>
            <edc:SFRFieldDef edc:cname="SIGNMODE" edc:nzwidth="0x2" edc:desc="Sign Mode">
              <edc:SFRFieldSemantic edc:cname="SE_UNSG_DF_SIGN" edc:desc="Single-ended channels: unsigned conversions Differential channels: signed conversions" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SE_SIGN_DF_UNSG" edc:desc="Single-ended channels: signed conversions Differential channels: unsigned conversions" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="ALL_UNSIGNED" edc:desc="All channels: unsigned conversions" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ALL_SIGNED" edc:desc="All channels: signed conversions" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCMODE" edc:nzwidth="0x2" edc:desc="ADC Running Mode">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode of operation." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="OFFSET_ERROR" edc:desc="Offset Error mode to measure the offset error. See Table 6-6 &quot;ADC Running Modes&quot;." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="GAIN_ERROR_HIGH" edc:desc="Gain Error mode to measure the gain error. See Table 6-6 &quot;ADC Running Modes&quot;." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="GAIN_ERROR_LOW" edc:desc="Gain Error mode to measure the gain error. See Table 6-6 &quot;ADC Running Modes&quot;." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CWR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40024054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="LOWTHRES" edc:nzwidth="0x10" edc:desc="Low Threshold"/>
            <edc:SFRFieldDef edc:cname="HIGHTHRES" edc:nzwidth="0x10" edc:desc="High Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40024058"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CCR" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4002405C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DIFF0" edc:nzwidth="0x1" edc:desc="Differential Inputs for Channel 0"/>
            <edc:SFRFieldDef edc:cname="DIFF1" edc:nzwidth="0x1" edc:desc="Differential Inputs for Channel 1"/>
            <edc:SFRFieldDef edc:cname="DIFF2" edc:nzwidth="0x1" edc:desc="Differential Inputs for Channel 2"/>
            <edc:SFRFieldDef edc:cname="DIFF3" edc:nzwidth="0x1" edc:desc="Differential Inputs for Channel 3"/>
            <edc:SFRFieldDef edc:cname="DIFF4" edc:nzwidth="0x1" edc:desc="Differential Inputs for Channel 4"/>
            <edc:SFRFieldDef edc:cname="DIFF5" edc:nzwidth="0x1" edc:desc="Differential Inputs for Channel 5"/>
            <edc:SFRFieldDef edc:cname="DIFF6" edc:nzwidth="0x1" edc:desc="Differential Inputs for Channel 6"/>
            <edc:SFRFieldDef edc:cname="DIFF7" edc:nzwidth="0x1" edc:desc="Differential Inputs for Channel 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR0" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40024060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
