Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SUB04RTC_FSTR" edc:nzwidth="0x20" edc:access="r---rrrr-rrrrrrr-rrrrrrr-rrrrrrr" edc:impl="0x8F7F7F7F" edc:_addr="0x40053180">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SEC" edc:nzwidth="0x7" edc:desc="Seconds of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MIN" edc:nzwidth="0x7" edc:desc="Minutes of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HOUR" edc:nzwidth="0x6" edc:desc="Hours of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:SFRFieldDef edc:cname="AMPM" edc:nzwidth="0x1" edc:desc="AM/PM Indicator of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TEVCNT" edc:nzwidth="0x4" edc:desc="Tamper Events Counter (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BACKUP" edc:nzwidth="0x1" edc:desc="System Mode of the Tamper (cleared by reading RTC_LSDRx)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SUB04RTC_FSDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40053184">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="UTC_TIME" edc:nzwidth="0x20" edc:desc="Time of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="YEAR" edc:nzwidth="0x7" edc:desc="Year of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:nzwidth="0x5" edc:desc="Month of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:SFRFieldDef edc:cname="DAY" edc:nzwidth="0x3" edc:desc="Day of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:SFRFieldDef edc:cname="DATE" edc:nzwidth="0x6" edc:desc="Date of the Tamper (cleared by reading RTC_LSDRx)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SUB04RTC_LSTR" edc:nzwidth="0x20" edc:access="r--------rrrrrrr-rrrrrrr-rrrrrrr" edc:impl="0x807F7F7F" edc:_addr="0x40053188">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SEC" edc:nzwidth="0x7" edc:desc="Seconds of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MIN" edc:nzwidth="0x7" edc:desc="Minutes of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HOUR" edc:nzwidth="0x6" edc:desc="Hours of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:SFRFieldDef edc:cname="AMPM" edc:nzwidth="0x1" edc:desc="AM/PM Indicator of the Tamper (cleared by reading RTC_LSDRx)"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BACKUP" edc:nzwidth="0x1" edc:desc="System Mode of the Tamper (cleared by reading RTC_LSDRx)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SUB04RTC_LSDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4005318C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="UTC_TIME" edc:nzwidth="0x20" edc:desc="Time of the Tamper (cleared on read)"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="YEAR" edc:nzwidth="0x7" edc:desc="Year of the Tamper (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:nzwidth="0x5" edc:desc="Month of the Tamper (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="DAY" edc:nzwidth="0x3" edc:desc="Day of the Tamper (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="DATE" edc:nzwidth="0x6" edc:desc="Date of the Tamper (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x40053190"/>
      <edc:SFRDef ltx:memberofperipheral="SYSCWP" edc:cname="SYSC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn------nn" edc:impl="0xFFFFFF03" edc:_addr="0x400531A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCWP">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN and WPITEN bits. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x535943"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SYSCWP" edc:cname="SYSC_WPSR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrr-------r" edc:impl="0xFF01" edc:_addr="0x400531A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCWP">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Register Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WVSRC" edc:nzwidth="0x8" edc:desc="Write Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x28" edc:_addr="0x400531A8"/>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_CR" edc:nzwidth="0x20" edc:access="wwwwwwww--------------------wwww" edc:impl="0xFF00000F" edc:_addr="0x400531D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="SHDW" edc:nzwidth="0x1" edc:desc="Shutdown"/>
            <edc:SFRFieldDef edc:cname="SHDWEOF" edc:nzwidth="0x1" edc:desc="Shutdown End Of Frame"/>
            <edc:SFRFieldDef edc:cname="VROFF" edc:nzwidth="0x1" edc:desc="Voltage Regulator Off">
              <edc:SFRFieldSemantic edc:cname="NO_EFFECT" edc:desc="No effect." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="STOP_VREG" edc:desc="If KEY=0xA5, VROFF asserts the VDDCORE domain reset and stops the voltage regulator." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TDXTALSEL" edc:nzwidth="0x1" edc:desc="Timing Domain Slow Clock Selector">
              <edc:SFRFieldSemantic edc:cname="RC" edc:desc="Slow clock of the timing domain is driven by the embedded 32 kHz (typical) RC oscillator." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="XTAL" edc:desc="Slow clock of the timing domain is driven by the 32.768 kHz crystal oscillator." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Password">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_SMMR" edc:nzwidth="0x20" edc:access="------------------nn-nnn----nnnn" edc:impl="0x370F" edc:_addr="0x400531D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="VDD3V3SMTH" edc:nzwidth="0x4" edc:desc="VDD3V3 Supply Monitor Threshold"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="VDD3V3SMSMPL" edc:nzwidth="0x3" edc:desc="VDD3V3 Supply Monitor Sampling Period">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="VDD3V3 supply monitor is disabled" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ALWAYS_ON" edc:desc="Continuous VDD3V3 supply monitoring" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="_32SLCK" edc:desc="VDD3V3 supply monitor is enabled for 1 period every 32 MD_SLCK periods Energy optimization in Backup mode with VDD3V3 supplied." edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="_256SLCK" edc:desc="VDD3V3 supply monitor is enabled for 1 period every 256 MD_SLCK periods Energy optimization in Backup mode with VDD3V3 supplied." edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="_2048SLCK" edc:desc="VDD3V3 supply monitor is enabled for 1 period every 2048 MD_SLCK periods Energy optimization in Backup mode with VDD3V3 supplied." edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VDD3V3SMRSTEN" edc:nzwidth="0x1" edc:desc="VDD3V3 Supply Monitor Reset Enable"/>
            <edc:SFRFieldDef edc:cname="VDD3V3SMPWRM" edc:nzwidth="0x1" edc:desc="VDD3V3 Supply Monitor Power Supply Mode">
              <edc:SFRFieldSemantic edc:cname="MANUAL" edc:desc="The VDDBU power source selection is controlled by configuring the bit RSTC_MR.PWRSW." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="AUTO_VDD3V3SM" edc:desc="The VDDBU power source is VBAT when a VDD3V3 undervoltage is detected by the VDD3V3 supply monitor." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_MR" edc:nzwidth="0x20" edc:access="nnnnnnnn---n-----nnn----nnnnnnnn" edc:impl="0xFF1070FF" edc:_addr="0x400531D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="LCDOUT" edc:nzwidth="0x4" edc:desc="LCD Voltage Regulator Output"/>
            <edc:SFRFieldDef edc:cname="LCDMODE" edc:nzwidth="0x2" edc:desc="LCD Controller Mode of Operation">
              <edc:SFRFieldSemantic edc:cname="LCDOFF" edc:desc="The internal supply source and the external supply source are both deselected (OFF Mode)." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LCDON_EXTVR" edc:desc="The external supply source for LCD (VDDLCD) is selected (the embedded LCD voltage regulator is in High-impedance mode)." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="LCDON_INVR" edc:desc="The internal voltage regulator for VDDLCD is selected (Active mode)." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CORSMM" edc:nzwidth="0x1" edc:desc="VDDCORE Supply Monitor Output Mode">
              <edc:SFRFieldSemantic edc:cname="NO_EFFECT" edc:desc="VDDCORE supply monitor output value has no effect. Power-on is performed whatever the value of the supply monitor output." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALID_VDD" edc:desc="VDDCORE supply monitor output value is checked to validate the VDDCORE domain power-on." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="VREGDIS" edc:nzwidth="0x1" edc:desc="Internal VDDCORE Voltage Regulator Disable">
              <edc:SFRFieldSemantic edc:cname="INT_VREG" edc:desc="Internal VDDCORE voltage regulator is enabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="EXT_VREG" edc:desc="Internal VDDCORE voltage regulator is disabled (external power supply is used)." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CORSMRSTEN" edc:nzwidth="0x1" edc:desc="VDDCORE Supply Monitor Reset Enable"/>
            <edc:SFRFieldDef edc:cname="CORSMDIS" edc:nzwidth="0x1" edc:desc="VDDCORE Supply Monitor Disable"/>
            <edc:SFRFieldDef edc:cname="IO_BACKUP_ISO" edc:nzwidth="0x1" edc:desc="Backup Domain IO Isolation Control"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="OSCBYPASS" edc:nzwidth="0x1" edc:desc="Slow Crystal Oscillator Bypass">
              <edc:SFRFieldSemantic edc:cname="NO_EFFECT" edc:desc="No effect. Clock selection depends on the value of the bit SUPC_CR.TDXTALSEL." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="BYPASS" edc:desc="The slow crystal oscillator is bypassed if SUPC_CR.TDXTALSEL=1. The bit OSCBYPASS must be set prior to setting the bit TDXTALSEL." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Password Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD1" edc:desc="Modifies the VREGDIS bit. Other bits are not affected." edc:when="(field &amp; 0xFF) == 0x59"/>
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
