Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_SR" edc:nzwidth="0x20" edc:access="rrrrrrrr---rrrrr---r---r-rrrrr-r" edc:impl="0xFF1F117D" edc:_addr="0x400531E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="TDOSCSEL" edc:nzwidth="0x1" edc:desc="Timing Domain 32 kHz Oscillator Selection Status">
              <edc:SFRFieldSemantic edc:cname="RC" edc:desc="The timing domain slow clock (TD_SLCK) source is the slow RC oscillator output." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="XTAL" edc:desc="The timing domain slow clock source is the 32.768 kHz crystal oscillator output." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VDD3V3SMWS" edc:nzwidth="0x1" edc:desc="VDD3V3 Supply Monitor Wake-up Status (cleared by reading SUPC_WUSR)"/>
            <edc:SFRFieldDef edc:cname="CORSMRSTS" edc:nzwidth="0x1" edc:desc="VDDCORE Supply Monitor Reset Status (cleared by reading SUPC_WUSR)"/>
            <edc:SFRFieldDef edc:cname="VDD3V3SMRSTS" edc:nzwidth="0x1" edc:desc="VDD3V3 Supply Monitor Reset Status (cleared by reading SUPC_WUSR)"/>
            <edc:SFRFieldDef edc:cname="VDD3V3SMIS" edc:nzwidth="0x1" edc:desc="VDD3V3 Supply Monitor Interrupt Status (cleared by reading SUPC_ISR)"/>
            <edc:SFRFieldDef edc:cname="VDD3V3SMS" edc:nzwidth="0x1" edc:desc="VDD3V3 Supply Monitor Output Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LCDS" edc:nzwidth="0x1" edc:desc="LCD Power Domain Status"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="FWUPS" edc:nzwidth="0x1" edc:desc="Force Wake-up Pin Status"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="LPDBCS0" edc:nzwidth="0x1" edc:desc="Tamper Detection Wake-up Status (cleared by reading SUPC_ISR)"/>
            <edc:SFRFieldDef edc:cname="LPDBCS1" edc:nzwidth="0x1" edc:desc="Tamper Detection Wake-up Status (cleared by reading SUPC_ISR)"/>
            <edc:SFRFieldDef edc:cname="LPDBCS2" edc:nzwidth="0x1" edc:desc="Tamper Detection Wake-up Status (cleared by reading SUPC_ISR)"/>
            <edc:SFRFieldDef edc:cname="LPDBCS3" edc:nzwidth="0x1" edc:desc="Tamper Detection Wake-up Status (cleared by reading SUPC_ISR)"/>
            <edc:SFRFieldDef edc:cname="LPDBCS4" edc:nzwidth="0x1" edc:desc="Tamper Detection Wake-up Status (cleared by reading SUPC_ISR)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SXFMS" edc:nzwidth="0x2" edc:desc="Slow Crystal Oscillator Frequency Monitor Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="GOOD" edc:desc="No frequency error detected." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FREQ_ERROR" edc:desc="The frequency has not been correct over 4 consecutive monitoring periods but there are still edges detected on the slow crystal oscillator output." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FAIL" edc:desc="No edge detected in the slow crystal oscillator output for at least 2 consecutive monitoring periods." edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SXFME" edc:nzwidth="0x1" edc:desc="Slow Crystal Oscillator Frequency Monitor Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="WKUPS" edc:nzwidth="0x1" edc:desc="WKUP Wake-up Status (cleared by reading SUPC_WUSR)"/>
            <edc:SFRFieldDef edc:cname="BADXTS" edc:nzwidth="0x1" edc:desc="Slow Crystal Oscillator Wake-up Status (cleared by reading SUPC_WUSR)"/>
            <edc:SFRFieldDef edc:cname="FWKUPS" edc:nzwidth="0x1" edc:desc="FWUP Wake-up Status (cleared by reading SUPC_WUSR)"/>
            <edc:SFRFieldDef edc:cname="RTTS" edc:nzwidth="0x1" edc:desc="RTT Wake-up Status (cleared by reading SUPC_WUSR)"/>
            <edc:SFRFieldDef edc:cname="RTCS" edc:nzwidth="0x1" edc:desc="RTC Wake-up Status (cleared by reading SUPC_WUSR)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x400531E8"/>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_EMR" edc:nzwidth="0x20" edc:access="-------------nnn----------------" edc:impl="0x70000" edc:_addr="0x400531EC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="FLRSGPBR" edc:nzwidth="0x1" edc:desc="Flash Erase GPBR"/>
            <edc:SFRFieldDef edc:cname="FULLGPBRC" edc:nzwidth="0x1" edc:desc="Full GPBR Clean"/>
            <edc:SFRFieldDef edc:cname="COREBGEN" edc:nzwidth="0x1" edc:desc="VDDCORE Voltage Regulator Bandgap Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_BMR" edc:nzwidth="0x20" edc:access="nnnnnnnn-------------nnn-nnn-nnn" edc:impl="0xFF000777" edc:_addr="0x400531F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="RTTWKEN" edc:nzwidth="0x1" edc:desc="Real-time Timer Wake-up Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The RTT alarm signal has no wake-up effect." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The RTT alarm signal forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RTCWKEN" edc:nzwidth="0x1" edc:desc="Real-time Clock Wake-up Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The RTC alarm signal has no wake-up effect." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The RTC alarm signal forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="VBATWKEN" edc:nzwidth="0x1" edc:desc="VBAT Supply Monitor Wake-up Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Wake-up on VBAT supply monitor under voltage detection is disabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Wake-up on VBAT supply monitor under voltage detection is enabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FWUPEN" edc:nzwidth="0x1" edc:desc="Force Wake-up Pin Wake-up Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The fwup signal has no wake-up effect." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The fwup signal forces the wake-up of the core power supply." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CORPORWKEN" edc:nzwidth="0x1" edc:desc="VDDCORE POR Wake-up Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Wake-up on VDDCORE Power-On Reset Event is disabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Wake-up on VDDCORE Power-On Reset Event is enabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="VDD3V3SMWKEN" edc:nzwidth="0x1" edc:desc="VDD3V3 Supply Monitor Wake-up Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Wake-up on VDD3V3 supply monitor under voltage detection is disabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Wake-up on VDD3V3 supply monitor under voltage detection is enabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VBATREN" edc:nzwidth="0x1" edc:desc="Battery Voltage Event Report Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disables the report of event on VBAT voltage." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Enables the report of event on VBAT voltage." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MRTCOUT" edc:nzwidth="0x1" edc:desc="RTCOUT0 Outputs Drive Mode">
              <edc:SFRFieldSemantic edc:cname="USERDEF" edc:desc="RTCOUT0 output is driven according to the configuration of the field RTC_MR.OUT0." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BADXTWKEN" edc:nzwidth="0x1" edc:desc="Slow Crystal Oscillator Frequency Error Wake-up Enable"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Password Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_WUSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrr-------r--rrrrrr" edc:impl="0xFFFF013F" edc:_addr="0x400531F4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="WKUPS" edc:nzwidth="0x1" edc:desc="WKUP Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="BADXTWKS" edc:nzwidth="0x1" edc:desc="Slow Crystal Oscillator Frequency Error Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="FWUPS" edc:nzwidth="0x1" edc:desc="FWUP Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="VDD3V3SMWS" edc:nzwidth="0x1" edc:desc="VDD3V3 Supply Monitor Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RTTS" edc:nzwidth="0x1" edc:desc="RTT Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RTCS" edc:nzwidth="0x1" edc:desc="RTC Wake-up Status (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VDD3V3SMRSTS" edc:nzwidth="0x1" edc:desc="VDD3V3 Supply Monitor Reset Status (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WKUPIS0" edc:nzwidth="0x1" edc:desc="WKUPx Input Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="WKUPIS1" edc:nzwidth="0x1" edc:desc="WKUPx Input Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="WKUPIS2" edc:nzwidth="0x1" edc:desc="WKUPx Input Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="WKUPIS3" edc:nzwidth="0x1" edc:desc="WKUPx Input Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="WKUPIS4" edc:nzwidth="0x1" edc:desc="WKUPx Input Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="WKUPIS5" edc:nzwidth="0x1" edc:desc="WKUPx Input Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="WKUPIS6" edc:nzwidth="0x1" edc:desc="WKUPx Input Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="WKUPIS7" edc:nzwidth="0x1" edc:desc="WKUPx Input Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="WKUPIS8" edc:nzwidth="0x1" edc:desc="WKUPx Input Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="WKUPIS9" edc:nzwidth="0x1" edc:desc="WKUPx Input Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="WKUPIS10" edc:nzwidth="0x1" edc:desc="WKUPx Input Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="WKUPIS11" edc:nzwidth="0x1" edc:desc="WKUPx Input Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="WKUPIS12" edc:nzwidth="0x1" edc:desc="WKUPx Input Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="WKUPIS13" edc:nzwidth="0x1" edc:desc="WKUPx Input Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="WKUPIS14" edc:nzwidth="0x1" edc:desc="WKUPx Input Wake-up Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="WKUPIS15" edc:nzwidth="0x1" edc:desc="WKUPx Input Wake-up Status (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_IER" edc:nzwidth="0x20" edc:access="--------------ww-----------wwwww" edc:impl="0x3001F" edc:_addr="0x400531F8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="LPDBC0" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LPDBC1" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LPDBC2" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LPDBC3" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LPDBC4" edc:nzwidth="0x1" edc:desc="WKUPx Pin Tamper Detection Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="VDD3V3SMEV" edc:nzwidth="0x1" edc:desc="VDD3V3 Supply Monitor Event Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="VBATSMEV" edc:nzwidth="0x1" edc:desc="VBAT Supply Monitor Event Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
