Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT1_RLIM" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:impl="0xFFF0FFF" edc:_addr="0x40053238">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="RPTHMIN" edc:nzwidth="0xC" edc:desc="Minimum Repeat Threshold"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RPTHMAX" edc:nzwidth="0xC" edc:desc="Maximum Repeat Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT1_PLIM" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:impl="0xFFF0FFF" edc:_addr="0x4005323C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="PERMIN" edc:nzwidth="0xC" edc:desc="Minimum Period"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PERMAX" edc:nzwidth="0xC" edc:desc="Maximum Period"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3FACDC0" edc:_addr="0x40053240"/>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="AES_CR" edc:nzwidth="0x20" edc:access="-------w---------------w------ww" edc:impl="0x1000103" edc:_addr="0x44000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x1" edc:desc="Start Processing"/>
            <edc:SFRFieldDef edc:cname="KSWP" edc:nzwidth="0x1" edc:desc="Key Swap"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="UNLOCK" edc:nzwidth="0x1" edc:desc="Unlock Processing"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="AES_MR" edc:nzwidth="0x20" edc:access="n-------nnnn-nnnnnnnnnnnnnnnn-nn" edc:impl="0x80F7FFFB" edc:_addr="0x44000004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="CIPHER" edc:nzwidth="0x1" edc:desc="Processing Mode"/>
            <edc:SFRFieldDef edc:cname="GTAGEN" edc:nzwidth="0x1" edc:desc="GCM Automatic Tag Generation Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DUALBUFF" edc:nzwidth="0x1" edc:desc="Dual Input Buffer">
              <edc:SFRFieldSemantic edc:cname="INACTIVE" edc:desc="AES_IDATARx cannot be written during processing of previous block." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ACTIVE" edc:desc="AES_IDATARx can be written during processing of previous block when SMOD = 2. It speeds up the overall runtime of large files." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PROCDLY" edc:nzwidth="0x4" edc:desc="Processing Delay"/>
            <edc:SFRFieldDef edc:cname="SMOD" edc:nzwidth="0x2" edc:desc="Start Mode">
              <edc:SFRFieldSemantic edc:cname="MANUAL_START" edc:desc="Manual Mode" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="AUTO_START" edc:desc="Auto Mode" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="IDATAR0_START" edc:desc="AES_IDATAR0 access only Auto Mode (PDC)" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="KEYSIZE" edc:nzwidth="0x2" edc:desc="Key Size">
              <edc:SFRFieldSemantic edc:cname="AES128" edc:desc="AES Key Size is 128 bits" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="AES192" edc:desc="AES Key Size is 192 bits" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="AES256" edc:desc="AES Key Size is 256 bits" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OPMOD" edc:nzwidth="0x3" edc:desc="Operating Mode">
              <edc:SFRFieldSemantic edc:cname="ECB" edc:desc="ECB: Electronic Codebook mode" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CBC" edc:desc="CBC: Cipher Block Chaining mode" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OFB" edc:desc="OFB: Output Feedback mode" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CFB" edc:desc="CFB: Cipher Feedback mode" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CTR" edc:desc="CTR: Counter mode (16-bit internal counter)" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="GCM" edc:desc="GCM: Galois/Counter mode" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LOD" edc:nzwidth="0x1" edc:desc="Last Output Data Mode"/>
            <edc:SFRFieldDef edc:cname="CFBS" edc:nzwidth="0x3" edc:desc="Cipher Feedback Data Size">
              <edc:SFRFieldSemantic edc:cname="SIZE_128BIT" edc:desc="128-bit" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SIZE_64BIT" edc:desc="64-bit" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SIZE_32BIT" edc:desc="32-bit" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SIZE_16BIT" edc:desc="16-bit" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SIZE_8BIT" edc:desc="8-bit" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CKEY" edc:nzwidth="0x4" edc:desc="Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="This field must be written with 0xE the first time AES_MR is programmed. For subsequent programming of AES_MR, any value can be written, including that of 0xE. Always reads as 0." edc:when="(field &amp; 0xF) == 0x0E"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TAMPCLR" edc:nzwidth="0x1" edc:desc="Tamper Clear Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
