Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x44000008"/>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="AES_IER" edc:nzwidth="0x20" edc:access="------------wwww-------w---wwwww" edc:impl="0xF011F" edc:_addr="0x44000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Unspecified Register Access Detection Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TAGRDY" edc:nzwidth="0x1" edc:desc="GCM Tag Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EOPAD" edc:nzwidth="0x1" edc:desc="End of Padding Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PLENERR" edc:nzwidth="0x1" edc:desc="Padding Length Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Security and/or Safety Event Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="AES_IDR" edc:nzwidth="0x20" edc:access="------------wwww-------w---wwwww" edc:impl="0xF011F" edc:_addr="0x44000014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Unspecified Register Access Detection Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TAGRDY" edc:nzwidth="0x1" edc:desc="GCM Tag Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="EOPAD" edc:nzwidth="0x1" edc:desc="End of Padding Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PLENERR" edc:nzwidth="0x1" edc:desc="Padding Length Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Security and/or Safety Event Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="AES_IMR" edc:nzwidth="0x20" edc:access="------------rrrr-------r---rrrrr" edc:impl="0xF011F" edc:_addr="0x44000018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Unspecified Register Access Detection Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TAGRDY" edc:nzwidth="0x1" edc:desc="GCM Tag Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="EOPAD" edc:nzwidth="0x1" edc:desc="End of Padding Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PLENERR" edc:nzwidth="0x1" edc:desc="Padding Length Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Security and/or Safety Event Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="AES_ISR" edc:nzwidth="0x20" edc:access="------------rrrrrrrr---r---rrrrr" edc:impl="0xFF11F" edc:_addr="0x4400001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:nzwidth="0x1" edc:desc="Data Ready (cleared by setting bit START or bit SWRST in AES_CR or by reading AES_ODATARx)"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of RX Buffer (cleared by writing AES_RCR or AES_RNCR)"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of TX Buffer (cleared by writing AES_TCR or AES_TNCR)"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="RX Buffer Full (cleared by writing AES_RCR or AES_RNCR)"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="TX Buffer Empty (cleared by writing AES_TCR or AES_TNCR)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Unspecified Register Access Detection Status (cleared by writing SWRST in AES_CR)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="URAT" edc:nzwidth="0x4" edc:desc="Unspecified Register Access (cleared by writing SWRST in AES_CR)">
              <edc:SFRFieldSemantic edc:cname="IDR_WR_PROCESSING" edc:desc="Input Data register written during the data processing when SMOD = 2 mode." edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ODR_RD_PROCESSING" edc:desc="Output Data register read during the data processing." edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="MR_WR_PROCESSING" edc:desc="Mode register written during the data processing." edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ODR_RD_SUBKGEN" edc:desc="Output Data register read during the sub-keys generation." edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="MR_WR_SUBKGEN" edc:desc="Mode register written during the sub-keys generation." edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="WOR_RD_ACCESS" edc:desc="Write-only register read access." edc:when="(field &amp; 0xF) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TAGRDY" edc:nzwidth="0x1" edc:desc="GCM Tag Ready"/>
            <edc:SFRFieldDef edc:cname="EOPAD" edc:nzwidth="0x1" edc:desc="End of Padding"/>
            <edc:SFRFieldDef edc:cname="PLENERR" edc:nzwidth="0x1" edc:desc="Padding Length Error"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Security and/or Safety Event (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AES" edc:cname="AES_KEYWR0" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x44000020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="KEYW" edc:nzwidth="0x20" edc:desc="Key Word"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
