Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="AESB" edc:cname="AESB_IDATAR2" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x44004048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AESB">
            <edc:SFRFieldDef edc:cname="IDATA" edc:nzwidth="0x20" edc:desc="Input Data Word"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AESB" edc:cname="AESB_IDATAR3" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4400404C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AESB">
            <edc:SFRFieldDef edc:cname="IDATA" edc:nzwidth="0x20" edc:desc="Input Data Word"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AESB" edc:cname="AESB_ODATAR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x44004050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AESB">
            <edc:SFRFieldDef edc:cname="ODATA" edc:nzwidth="0x20" edc:desc="Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AESB" edc:cname="AESB_ODATAR1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x44004054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AESB">
            <edc:SFRFieldDef edc:cname="ODATA" edc:nzwidth="0x20" edc:desc="Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AESB" edc:cname="AESB_ODATAR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x44004058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AESB">
            <edc:SFRFieldDef edc:cname="ODATA" edc:nzwidth="0x20" edc:desc="Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AESB" edc:cname="AESB_ODATAR3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4400405C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AESB">
            <edc:SFRFieldDef edc:cname="ODATA" edc:nzwidth="0x20" edc:desc="Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AESB" edc:cname="AESB_IVR0" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x44004060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AESB">
            <edc:SFRFieldDef edc:cname="IV" edc:nzwidth="0x20" edc:desc="Initialization Vector"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AESB" edc:cname="AESB_IVR1" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x44004064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AESB">
            <edc:SFRFieldDef edc:cname="IV" edc:nzwidth="0x20" edc:desc="Initialization Vector"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AESB" edc:cname="AESB_IVR2" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x44004068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AESB">
            <edc:SFRFieldDef edc:cname="IV" edc:nzwidth="0x20" edc:desc="Initialization Vector"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AESB" edc:cname="AESB_IVR3" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4400406C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AESB">
            <edc:SFRFieldDef edc:cname="IV" edc:nzwidth="0x20" edc:desc="Initialization Vector"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x40" edc:_addr="0x44004070"/>
      <edc:SFRDef ltx:memberofperipheral="AESB" edc:cname="AESB_EMR" edc:nzwidth="0x20" edc:access="------------------------nn------" edc:impl="0xC0" edc:_addr="0x440040B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AESB">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="PKWO" edc:nzwidth="0x1" edc:desc="Private Key Write Once"/>
            <edc:SFRFieldDef edc:cname="PKRS" edc:nzwidth="0x1" edc:desc="Private Key Internal Register Select"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x30" edc:_addr="0x440040B4"/>
      <edc:SFRDef ltx:memberofperipheral="AESB" edc:cname="AESB_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnn-nnn" edc:impl="0xFFFFFFF7" edc:_addr="0x440040E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AESB">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Configuration Enable"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interruption Enable"/>
            <edc:SFRFieldDef edc:cname="WPCREN" edc:nzwidth="0x1" edc:desc="Write Protection Control Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIRSTE" edc:nzwidth="0x1" edc:desc="First Error Report Enable"/>
            <edc:SFRFieldDef edc:cname="ACTION" edc:nzwidth="0x3" edc:desc="Action on Abnormal Event Detection">
              <edc:SFRFieldSemantic edc:cname="REPORT_ONLY" edc:desc="No action (stop or clear key) is performed when one of PKRPVS, WPVS, CGD, SEQE, or SWE flags is set." edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LOCK_PKRPVS_WPVS_SWE" edc:desc="If a processing is in progress when the AESB_WPSR.PKRPVS/WPVS/SWE event detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued." edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="LOCK_CGD_SEQE" edc:desc="If a processing is in progress when the AESB_WPSR.CGD/SEQE event detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued." edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="LOCK_ANY_EV" edc:desc="If a processing is in progress when the AESB_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued." edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR_PKRPVS_WPVS_SWE" edc:desc="If a processing is in progress when the AESB_WPSR.PKRPVS/WPVS/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued. Moreover, the AESB_KEYWRx key is immediately cleared." edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR_CGD_SEQE" edc:desc="If a processing is in progress when the AESB_WPSR.CGD/SEQE events detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued. Moreover, the AESB_KEYWRx key is immediately cleared." edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR_ANY_EV" edc:desc="If a processing is in progress when the AESB_WPSR.PKRPVS/WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a AESB_CR.UNLOCK command is issued. Moreover, the AESB_KEYWRx key is immediately cleared." edc:when="(field &amp; 0x7) == 0x06"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN,WPITEN,WPCREN bits. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x414553"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AESB" edc:cname="AESB_WPSR" edc:nzwidth="0x20" edc:access="r---rrrr--------rrrrrrrr---rrrrr" edc:impl="0x8F00FF1F" edc:_addr="0x440040E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AESB">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CGD" edc:nzwidth="0x1" edc:desc="Clock Glitch Detected (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SEQE" edc:nzwidth="0x1" edc:desc="Internal Sequencer Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SWE" edc:nzwidth="0x1" edc:desc="Software Control Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="PKRPVS" edc:nzwidth="0x1" edc:desc="Private Key Internal Register Protection Violation Status (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x8" edc:desc="Write Protection Violation Source"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="SWETYP" edc:nzwidth="0x4" edc:desc="Software Error Type (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="READ_WO" edc:desc="A write-only register has been read (Warning)." edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="WRITE_RO" edc:desc="AESB is enabled and a write access has been performed on a read-only register (Warning)." edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UNDEF_RW" edc:desc="Access to an undefined address (Warning)." edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CTRL_START" edc:desc="Abnormal use of AESB_CR.START command when DMA access is configured." edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="WEIRD_ACTION" edc:desc="A Private Key Bus access, key write, init value write, output data read or AESB_MR and AESB_EMR write has been performed while a process is in progress (abnormal)." edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="INCOMPLETE_KEY" edc:desc="A tentative of start is required while the key is not fully loaded into the AESB_KEYWRx registers." edc:when="(field &amp; 0xF) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ECLASS" edc:nzwidth="0x1" edc:desc="Software Error Class (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="WARNING" edc:desc="An abnormal access that does not affect system functionality" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERROR" edc:desc="An access is performed into key, input data, control registers while the AESB is performing an encryption/decryption or a start is request by software or DMA while the key is not fully configured." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F14" edc:_addr="0x440040EC"/>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_CR" edc:nzwidth="0x20" edc:access="-------w----------ww---w---w---w" edc:impl="0x1003111" edc:_addr="0x44008000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x1" edc:desc="Start Processing"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="FIRST" edc:nzwidth="0x1" edc:desc="First Block of a Message"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="WUIHV" edc:nzwidth="0x1" edc:desc="Write User Initial Hash Values"/>
            <edc:SFRFieldDef edc:cname="WUIEHV" edc:nzwidth="0x1" edc:desc="Write User Initial or Expected Hash Values"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="UNLOCK" edc:nzwidth="0x1" edc:desc="Unlock Processing"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_MR" edc:nzwidth="0x20" edc:access="nnnn--nn-------nn---nnnnnnnnn-nn" edc:impl="0xF3018FFB" edc:_addr="0x44008004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="SMOD" edc:nzwidth="0x2" edc:desc="Start Mode">
              <edc:SFRFieldSemantic edc:cname="MANUAL_START" edc:desc="Manual mode" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="AUTO_START" edc:desc="Auto mode" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="IDATAR0_START" edc:desc="SHA_IDATAR0 access only mode (mandatory when DMA is used)" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="AOE" edc:nzwidth="0x1" edc:desc="Always ON Enable"/>
            <edc:SFRFieldDef edc:cname="PROCDLY" edc:nzwidth="0x1" edc:desc="Processing Delay">
              <edc:SFRFieldSemantic edc:cname="SHORTEST" edc:desc="SHA processing runtime is the shortest one" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LONGEST" edc:desc="SHA processing runtime is the longest one (reduces the SHA bandwidth requirement, reduces the system bus overload)" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="UIHV" edc:nzwidth="0x1" edc:desc="User Initial Hash Value Registers"/>
            <edc:SFRFieldDef edc:cname="UIEHV" edc:nzwidth="0x1" edc:desc="User Initial or Expected Hash Value Registers"/>
            <edc:SFRFieldDef edc:cname="BPE" edc:nzwidth="0x1" edc:desc="Block Processing End"/>
            <edc:SFRFieldDef edc:cname="ALGO" edc:nzwidth="0x4" edc:desc="SHA Algorithm">
              <edc:SFRFieldSemantic edc:cname="SHA1" edc:desc="SHA1 algorithm processed" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SHA256" edc:desc="SHA256 algorithm processed" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SHA384" edc:desc="SHA384 algorithm processed" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SHA512" edc:desc="SHA512 algorithm processed" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SHA224" edc:desc="SHA224 algorithm processed" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SHA512_224" edc:desc="SHA512/224 algorithm processed" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="SHA512_256" edc:desc="SHA512/256 algorithm processed" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="HMAC_SHA1" edc:desc="HMAC algorithm with SHA1 Hash processed" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="HMAC_SHA256" edc:desc="HMAC algorithm with SHA256 Hash processed" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="HMAC_SHA384" edc:desc="HMAC algorithm with SHA384 Hash processed" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="HMAC_SHA512" edc:desc="HMAC algorithm with SHA512 Hash processed" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="HMAC_SHA224" edc:desc="HMAC algorithm with SHA224 Hash processed" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="HMAC_SHA512_224" edc:desc="HMAC algorithm with SHA512/224 Hash processed" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="HMAC_SHA512_256" edc:desc="HMAC algorithm with SHA512/256 Hash processed" edc:when="(field &amp; 0xF) == 0x0E"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TMPLCK" edc:nzwidth="0x1" edc:desc="Tamper Lock Enable"/>
            <edc:SFRFieldDef edc:cname="DUALBUFF" edc:nzwidth="0x1" edc:desc="Dual Input Buffer">
              <edc:SFRFieldSemantic edc:cname="INACTIVE" edc:desc="SHA_IDATARx and SHA_IODATARx cannot be written during processing of previous block." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ACTIVE" edc:desc="SHA_IDATARx and SHA_IODATARx can be written during processing of previous block when SMOD value = 2. It speeds up the overall runtime of large files." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="CHECK" edc:nzwidth="0x2" edc:desc="Hash Check">
              <edc:SFRFieldSemantic edc:cname="NO_CHECK" edc:desc="No check is performed" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CHECK_EHV" edc:desc="Check is performed with expected hash stored in internal expected hash value registers." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CHECK_MESSAGE" edc:desc="Check is performed with expected hash provided after the message." edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CHKCNT" edc:nzwidth="0x4" edc:desc="Check Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x44008008"/>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IER" edc:nzwidth="0x20" edc:access="-------w-------w-------w-----www" edc:impl="0x1010107" edc:_addr="0x44008010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Unspecified Register Access Detection Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="CHECKF" edc:nzwidth="0x1" edc:desc="Check Done Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Security and/or Safety Event Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
