Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IODATAR8" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x440080A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IODATA" edc:nzwidth="0x20" edc:desc="Input/Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IODATAR9" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x440080A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IODATA" edc:nzwidth="0x20" edc:desc="Input/Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IODATAR10" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x440080A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IODATA" edc:nzwidth="0x20" edc:desc="Input/Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IODATAR11" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x440080AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IODATA" edc:nzwidth="0x20" edc:desc="Input/Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IODATAR12" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x440080B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IODATA" edc:nzwidth="0x20" edc:desc="Input/Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IODATAR13" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x440080B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IODATA" edc:nzwidth="0x20" edc:desc="Input/Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IODATAR14" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x440080B8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IODATA" edc:nzwidth="0x20" edc:desc="Input/Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IODATAR15" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x440080BC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IODATA" edc:nzwidth="0x20" edc:desc="Input/Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x24" edc:_addr="0x440080C0"/>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:impl="0xFFFFFF77" edc:_addr="0x440080E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Configuration Enable"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interruption Enable"/>
            <edc:SFRFieldDef edc:cname="WPCREN" edc:nzwidth="0x1" edc:desc="Write Protection Control Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIRSTE" edc:nzwidth="0x1" edc:desc="First Error Report Enable"/>
            <edc:SFRFieldDef edc:cname="ACTION" edc:nzwidth="0x2" edc:desc="Action on Abnormal Event Detection">
              <edc:SFRFieldSemantic edc:cname="REPORT_ONLY" edc:desc="No action (stop or clear key) is performed when one of WPVS,CGD,SEQE, or SWE flag is set." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LOCK_WPVS_SWE" edc:desc="If a processing is in progress when the SHA_WPSR.WPVS/SWE event detection occurs, the current processing is ended normally but no other processing is started while a SHA_CR.UNLOCK command is issued." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="LOCK_CGD_SEQE" edc:desc="If a processing is in progress when the SHA_WPSR.CGD/SEQE event detection occurs, the current processing is ended normally but no other processing is started while a SHA_CR.UNLOCK command is issued." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="LOCK_ANY_EV" edc:desc="If a processing is in progress when the SHA_WPSR.WPVS/CGD/SEQE/SWE events detection occurs, the current processing is ended normally but no other processing is started while a SHA_CR.UNLOCK command is issued." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN,WPITEN,WPCREN bits. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x534841"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_WPSR" edc:nzwidth="0x20" edc:access="r---rrrr--------rrrrrrrr----rrrr" edc:impl="0x8F00FF0F" edc:_addr="0x440080E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CGD" edc:nzwidth="0x1" edc:desc="Clock Glitch Detected (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SEQE" edc:nzwidth="0x1" edc:desc="Internal Sequencer Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SWE" edc:nzwidth="0x1" edc:desc="Software Control Error (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x8" edc:desc="Write Protection Violation Source"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="SWETYP" edc:nzwidth="0x4" edc:desc="Software Error Type (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="READ_WO" edc:desc="A write-only register has been read (Warning)." edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="WRITE_RO" edc:desc="SHA is enabled and a write access has been performed on a read-only register (Warning)." edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UNDEF_RW" edc:desc="Access to an undefined address (Warning)." edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CTRL_START" edc:desc="SHA is locked and a start command with SHA_CR.START has been performed." edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="AUTO_START" edc:desc="SHA is locked and a tentative automatic start has been performed by writing input data registers (SHA_MR.SMOD&gt;0)." edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="BAD_START" edc:desc="SHA is not locked and a start command with SHA_CR.START has been performed whereas Start mode is automatic (SHA_MR.SMOD&gt;0)" edc:when="(field &amp; 0xF) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ECLASS" edc:nzwidth="0x1" edc:desc="Software Error Class (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="WARNING" edc:desc="An abnormal access that does not affect system functionality" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERROR" edc:desc="An access is performed into key, input data, control registers while the SHA is performing an encryption/decryption or a start is request by software or DMA while the key is not fully configured." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0x440080EC"/>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_TPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x44008108">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="TXPTR" edc:nzwidth="0x20" edc:desc="Transmit Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_TCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4400810C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="TXCTR" edc:nzwidth="0x10" edc:desc="Transmit Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x44008110"/>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_TNPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x44008118">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="TXNPTR" edc:nzwidth="0x20" edc:desc="Transmit Next Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_TNCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4400811C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="TXNCTR" edc:nzwidth="0x10" edc:desc="Transmit Counter Next"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_PTCR" edc:nzwidth="0x20" edc:access="-------w----wwww------ww------ww" edc:impl="0x10F0303" edc:_addr="0x44008120">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:nzwidth="0x1" edc:desc="Receiver Transfer Enable"/>
            <edc:SFRFieldDef edc:cname="RXTDIS" edc:nzwidth="0x1" edc:desc="Receiver Transfer Disable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Enable"/>
            <edc:SFRFieldDef edc:cname="TXTDIS" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Disable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:nzwidth="0x1" edc:desc="Receiver Circular Buffer Enable"/>
            <edc:SFRFieldDef edc:cname="RXCBDIS" edc:nzwidth="0x1" edc:desc="Receiver Circular Buffer Disable"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:nzwidth="0x1" edc:desc="Transmitter Circular Buffer Enable"/>
            <edc:SFRFieldDef edc:cname="TXCBDIS" edc:nzwidth="0x1" edc:desc="Transmitter Circular Buffer Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ERRCLR" edc:nzwidth="0x1" edc:desc="Transfer Bus Error Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_PTSR" edc:nzwidth="0x20" edc:access="-------r-----r-r-------r-------r" edc:impl="0x1050101" edc:_addr="0x44008124">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:nzwidth="0x1" edc:desc="Receiver Transfer Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RXCBEN" edc:nzwidth="0x1" edc:desc="Receiver Circular Buffer Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCBEN" edc:nzwidth="0x1" edc:desc="Transmitter Circular Buffer Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Transfer Bus Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_PWPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-----nnn" edc:impl="0xFFFFFF07" edc:_addr="0x44008128">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="WPPTREN" edc:nzwidth="0x1" edc:desc="Write Protection Pointer Registers Enable"/>
            <edc:SFRFieldDef edc:cname="WPCTREN" edc:nzwidth="0x1" edc:desc="Write Protection Counter Registers Enable"/>
            <edc:SFRFieldDef edc:cname="WPCREN" edc:nzwidth="0x1" edc:desc="Write Protection Control Register Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x504443"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3ED4" edc:_addr="0x4400812C"/>
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="TRNG_CR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwww-------w" edc:impl="0xFFFFFF01" edc:_addr="0x4400C000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable TRNG to Provide Random Values"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WAKEY" edc:nzwidth="0x18" edc:desc="Register Write Access Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFFFFFF) == 0x524E47"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="TRNG_MR" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x4400C004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="HALFR" edc:nzwidth="0x1" edc:desc="Half Rate Enable">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Maximum stream rate provided (1 sample every 84 MCK clock cycles)." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Half maximum stream rate provided if the peripheral clock frequency is above 100 MHz (1 sample every 168 MCK clock cycles)." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="TRNG_PKBCR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwww--ww---w" edc:impl="0xFFFFFF31" edc:_addr="0x4400C008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="KID" edc:nzwidth="0x1" edc:desc="Key ID (Must be Always Written to 0)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="KSLAVE" edc:nzwidth="0x2" edc:desc="Key Bus Client">
              <edc:SFRFieldSemantic edc:cname="AES_ID" edc:desc="AES" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="AESB_ID" edc:desc="AESB" edc:when="(field &amp; 0x3) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="KLENGTH" edc:nzwidth="0x8" edc:desc="Key Length"/>
            <edc:SFRFieldDef edc:cname="WAKEY" edc:nzwidth="0x10" edc:desc="Register Write Access Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFFFF) == 0x524B"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
