Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_IMR" edc:nzwidth="0x20" edc:access="-------rrrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0x1FFFFFF" edc:_addr="0x44010018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:nzwidth="0x4" edc:desc="Region Hash Completed Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:nzwidth="0x4" edc:desc="Region Digest Mismatch Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:nzwidth="0x4" edc:desc="Region Bus Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:nzwidth="0x4" edc:desc="Region Wrap Condition Detected Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="REC" edc:nzwidth="0x4" edc:desc="Region End bit Condition Detected Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:nzwidth="0x4" edc:desc="Region Status Updated Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Undefined Register Access Detection Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_ISR" edc:nzwidth="0x20" edc:access="-------rrrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0x1FFFFFF" edc:_addr="0x4401001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:nzwidth="0x4" edc:desc="Region Hash Completed"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:nzwidth="0x4" edc:desc="Region Digest Mismatch"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:nzwidth="0x4" edc:desc="Region Bus Error"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:nzwidth="0x4" edc:desc="Region Wrap Condition Detected"/>
            <edc:SFRFieldDef edc:cname="REC" edc:nzwidth="0x4" edc:desc="Region End Bit Condition Detected"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:nzwidth="0x4" edc:desc="Region Status Updated Detected"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Undefined Register Access Detection Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UASR" edc:nzwidth="0x20" edc:access="-----------------------------rrr" edc:impl="0x7" edc:_addr="0x44010020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="URAT" edc:nzwidth="0x3" edc:desc="Undefined Register Access Trace">
              <edc:SFRFieldSemantic edc:cname="UNSPEC_STRUCT_MEMBER" edc:desc="Unspecified structure member set to one detected when the descriptor is loaded." edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ICM_CFG_MODIFIED" edc:desc="ICM_CFG modified during active monitoring." edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="ICM_DSCR_MODIFIED" edc:desc="ICM_DSCR modified during active monitoring." edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ICM_HASH_MODIFIED" edc:desc="ICM_HASH modified during active monitoring" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="READ_ACCESS" edc:desc="Write-only register read access" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x44010024"/>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_DSCR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnn------" edc:impl="0xFFFFFFC0" edc:_addr="0x44010030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DASA" edc:nzwidth="0x1A" edc:desc="Descriptor Area Start Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_HASH" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn--------" edc:impl="0xFFFFFF00" edc:_addr="0x44010034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="HASA" edc:nzwidth="0x18" edc:desc="Hash Area Start Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL0" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x44010038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL1" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4401003C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL2" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x44010040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL3" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x44010044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL4" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x44010048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL5" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4401004C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL6" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x44010050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL7" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x44010054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL8" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x44010058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
