Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="CPKCC" edc:cname="CPKCC_J" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPKCC">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x20" edc:desc="CPKCC_J value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CPKCC" edc:cname="CPKCC_K" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46000014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPKCC">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x20" edc:desc="CPKCC_K value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CPKCC" edc:cname="CPKCC_N" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46000018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPKCC">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x20" edc:desc="CPKCC_N value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CPKCC" edc:cname="CPKCC_SMULA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4600001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPKCC">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x20" edc:desc="CPKCC_SMULA value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CPKCC" edc:cname="CPKCC_SMULB" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46000020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPKCC">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x20" edc:desc="CPKCC_SMULB value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CPKCC" edc:cname="CPKCC_SMULRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46000024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPKCC">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x20" edc:desc="CPKCC_SMULRL value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CPKCC" edc:cname="CPKCC_SMULRH" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46000028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPKCC">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x20" edc:desc="CPKCC_SMULRH value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CPKCC" edc:cname="CPKCC_IDLE" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x4600002C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPKCC">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x8" edc:desc="CPKCC_IDLE value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CPKCC" edc:cname="CPKCC_IDLECACHE" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x4600002D">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPKCC">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x8" edc:desc="CPKCC_IDLECACHE value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4600002E"/>
      <edc:SFRDef ltx:memberofperipheral="CPKCC" edc:cname="CPKCC_CR_C" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46000030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPKCC">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x20" edc:desc="CPKCC_CR_C value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CPKCC" edc:cname="CPKCC_CR_S" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46000034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPKCC">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x20" edc:desc="CPKCC_CR_S value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CPKCC" edc:cname="CPKCC_CR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46000038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPKCC">
            <edc:SFRFieldDef edc:cname="GF2N" edc:nzwidth="0x1" edc:desc="GF(2n) mode"/>
            <edc:SFRFieldDef edc:cname="CARRYIN" edc:nzwidth="0x1" edc:desc="CARRYIN value"/>
            <edc:SFRFieldDef edc:cname="ONEMUL" edc:nzwidth="0x1" edc:desc="ONEMUL value"/>
            <edc:SFRFieldDef edc:cname="ABORT" edc:nzwidth="0x1" edc:desc="ABORT value"/>
            <edc:SFRFieldDef edc:cname="SPILLW" edc:nzwidth="0x1" edc:desc="Spill Word register bit"/>
            <edc:SFRFieldDef edc:cname="AWAKE" edc:nzwidth="0x1" edc:desc="AWAKE value"/>
            <edc:SFRFieldDef edc:cname="PKCCIRQ" edc:nzwidth="0x1" edc:desc="CPKCC_IRQ value"/>
            <edc:SFRFieldDef edc:cname="ITEN" edc:nzwidth="0x1" edc:desc="ITEN value"/>
            <edc:SFRFieldDef edc:cname="CLRRAM" edc:nzwidth="0x1" edc:desc="CLRRAM value"/>
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x17" edc:desc="CPKCC_CR value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CPKCC" edc:cname="CPKCC_OR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnn--nnnnnnnn" edc:impl="0xFFFFFCFF" edc:_addr="0x4600003C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPKCC">
            <edc:SFRFieldDef edc:cname="CMD0" edc:nzwidth="0x1" edc:desc="CMD0 value"/>
            <edc:SFRFieldDef edc:cname="CMD1" edc:nzwidth="0x1" edc:desc="CMD1 value"/>
            <edc:SFRFieldDef edc:cname="CMD2" edc:nzwidth="0x1" edc:desc="CMD2 value"/>
            <edc:SFRFieldDef edc:cname="CMD3" edc:nzwidth="0x1" edc:desc="CMD3 value"/>
            <edc:SFRFieldDef edc:cname="OPTM0" edc:nzwidth="0x1" edc:desc="OPTM0 value"/>
            <edc:SFRFieldDef edc:cname="OPTM1" edc:nzwidth="0x1" edc:desc="OPTM1 value"/>
            <edc:SFRFieldDef edc:cname="OPTC0" edc:nzwidth="0x1" edc:desc="OPTC0 value"/>
            <edc:SFRFieldDef edc:cname="OPTC1" edc:nzwidth="0x1" edc:desc="OPTC1 value"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CARRYMUL" edc:nzwidth="0x1" edc:desc="CARRYMUL value"/>
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x15" edc:desc="CPKCC_OR value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CPKCC" edc:cname="CPKCC_SR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x46000040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPKCC">
            <edc:SFRFieldDef edc:cname="BUSY" edc:nzwidth="0x1" edc:desc="BUSY value"/>
            <edc:SFRFieldDef edc:cname="CACHE" edc:nzwidth="0x1" edc:desc="CACHE value"/>
            <edc:SFRFieldDef edc:cname="CARRY" edc:nzwidth="0x1" edc:desc="CARRY value"/>
            <edc:SFRFieldDef edc:cname="ZERO" edc:nzwidth="0x1" edc:desc="ZERO value"/>
            <edc:SFRFieldDef edc:cname="RAMV" edc:nzwidth="0x1" edc:desc="RAM violation"/>
            <edc:SFRFieldDef edc:cname="SHAREV" edc:nzwidth="0x1" edc:desc="SHAREV value"/>
            <edc:SFRFieldDef edc:cname="CLRRAM_BUSY" edc:nzwidth="0x1" edc:desc="CLRRAM_BUSY value"/>
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x19" edc:desc="CPKCC_SR value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
