Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PPSELR2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x460042C8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="USERP0" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP1" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP2" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP3" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP4" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP5" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP6" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP7" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP8" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP9" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP10" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP11" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP12" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP13" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP14" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP15" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP16" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP17" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP18" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP19" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP20" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP21" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP22" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP23" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP24" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP25" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP26" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP27" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP28" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP29" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP30" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP31" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3D34" edc:_addr="0x460042CC"/>
      <edc:SFRDef ltx:memberofperipheral="CMCC0" edc:cname="CMCC0_TYPE" edc:nzwidth="0x20" edc:access="------------------rrrrrrrrrrrrrr" edc:impl="0x3FFF" edc:_addr="0x46008000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC0">
            <edc:SFRFieldDef edc:cname="AP" edc:nzwidth="0x1" edc:desc="Access Port Access Allowed"/>
            <edc:SFRFieldDef edc:cname="GCLK" edc:nzwidth="0x1" edc:desc="Dynamic Clock Gating Supported"/>
            <edc:SFRFieldDef edc:cname="RANDP" edc:nzwidth="0x1" edc:desc="Random Selection Policy Supported"/>
            <edc:SFRFieldDef edc:cname="LRUP" edc:nzwidth="0x1" edc:desc="Least Recently Used Policy Supported"/>
            <edc:SFRFieldDef edc:cname="RRP" edc:nzwidth="0x1" edc:desc="Random Selection Policy Supported"/>
            <edc:SFRFieldDef edc:cname="WAYNUM" edc:nzwidth="0x2" edc:desc="Number of Ways">
              <edc:SFRFieldSemantic edc:cname="DMAPPED" edc:desc="Direct Mapped Cache" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ARCH2WAY" edc:desc="2-way set associative" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="ARCH4WAY" edc:desc="4-way set associative" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ARCH8WAY" edc:desc="8-way set associative" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LCKDOWN" edc:nzwidth="0x1" edc:desc="Lockdown Supported"/>
            <edc:SFRFieldDef edc:cname="CSIZE" edc:nzwidth="0x3" edc:desc="Data Cache Size">
              <edc:SFRFieldSemantic edc:cname="CSIZE_1KB" edc:desc="Cache size is 1 Kbyte" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_2KB" edc:desc="Cache size is 2 Kbytes" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_4KB" edc:desc="Cache size is 4 Kbytes" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_8KB" edc:desc="Cache size is 8 Kbytes" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_16KB" edc:desc="Cache size is 16 Kbytes" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_32KB" edc:desc="Cache size is 32 Kbytes" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CSIZE_64KB" edc:desc="Cache size is 64 Kbytes" edc:when="(field &amp; 0x7) == 0x06"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CLSIZE" edc:nzwidth="0x3" edc:desc="Cache LIne Size">
              <edc:SFRFieldSemantic edc:cname="CLSIZE_1KB" edc:desc="Cache line size is 4 bytes" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CLSIZE_2KB" edc:desc="Cache line size is 8 bytes" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CLSIZE_4KB" edc:desc="Cache line size is 16 bytes" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CLSIZE_8KB" edc:desc="Cache line size is 32 bytes" edc:when="(field &amp; 0x7) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CMCC0" edc:cname="CMCC0_CFG" edc:nzwidth="0x20" edc:access="-----------------------n-nnn-nnn" edc:impl="0x177" edc:_addr="0x46008004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CMCC0">
            <edc:SFRFieldDef edc:cname="GCLKDIS" edc:nzwidth="0x1" edc:desc="Disable Clock Gating"/>
            <edc:SFRFieldDef edc:cname="ICDIS" edc:nzwidth="0x1" edc:desc="Instruction Caching Disable"/>
            <edc:SFRFieldDef edc:cname="DCDIS" edc:nzwidth="0x1" edc:desc="Data Caching Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRGCSIZE" edc:nzwidth="0x3" edc:desc="Programmable Cache Size"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCK" edc:nzwidth="0x1" edc:desc="Configuration Lock Until Next System Reset (Write-once)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
