Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="SEFC0" edc:cname="EEFC_KBLR" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x460E0014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SEFC0">
            <edc:SFRFieldDef edc:cname="KBTLUSB0" edc:nzwidth="0x1" edc:desc="Key Bus Transfer Lock from User Signature Block 0"/>
            <edc:SFRFieldDef edc:cname="KBTLUSB1" edc:nzwidth="0x1" edc:desc="Key Bus Transfer Lock from User Signature Block 1"/>
            <edc:SFRFieldDef edc:cname="KBTLUSB2" edc:nzwidth="0x1" edc:desc="Key Bus Transfer Lock from User Signature Block 2"/>
            <edc:SFRFieldDef edc:cname="KBTLUSB3" edc:nzwidth="0x1" edc:desc="Key Bus Transfer Lock from User Signature Block 3"/>
            <edc:SFRFieldDef edc:cname="KBTLUSB4" edc:nzwidth="0x1" edc:desc="Key Bus Transfer Lock from User Signature Block 4"/>
            <edc:SFRFieldDef edc:cname="KBTLUSB5" edc:nzwidth="0x1" edc:desc="Key Bus Transfer Lock from User Signature Block 5"/>
            <edc:SFRFieldDef edc:cname="KBTLUSB6" edc:nzwidth="0x1" edc:desc="Key Bus Transfer Lock from User Signature Block 6"/>
            <edc:SFRFieldDef edc:cname="KBTLUSB7" edc:nzwidth="0x1" edc:desc="Key Bus Transfer Lock from User Signature Block 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xCC" edc:_addr="0x460E0018"/>
      <edc:SFRDef ltx:memberofperipheral="SEFC0" edc:cname="EEFC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn--nnnnn" edc:impl="0xFFFFFF9F" edc:_addr="0x460E00E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SEFC0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:SFRFieldDef edc:cname="GPNVMWP" edc:nzwidth="0x1" edc:desc="GPNVM Bit Write Protection"/>
            <edc:SFRFieldDef edc:cname="LOCKWP" edc:nzwidth="0x1" edc:desc="Lock Bit Write Protection"/>
            <edc:SFRFieldDef edc:cname="ERASEWP" edc:nzwidth="0x1" edc:desc="Erase and Write Protection"/>
            <edc:SFRFieldDef edc:cname="USRWP" edc:nzwidth="0x1" edc:desc="User Signature Write Protection"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ERASEWL" edc:nzwidth="0x1" edc:desc="Erase and Write Lock"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x454643"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x118" edc:_addr="0x460E00E8"/>
      <edc:SFRDef ltx:memberofperipheral="SEFC1" edc:cname="EEFC_FMR" edc:nzwidth="0x20" edc:access="----nn---------n----nnnn-------n" edc:impl="0xC010F01" edc:_addr="0x460E0200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SEFC1">
            <edc:SFRFieldDef edc:cname="FRDY" edc:nzwidth="0x1" edc:desc="Flash Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="FWS" edc:nzwidth="0x4" edc:desc="Flash Wait State"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SCOD" edc:nzwidth="0x1" edc:desc="Sequential Code Optimization Disable"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CLOE" edc:nzwidth="0x1" edc:desc="Code Loop Optimization Enable"/>
            <edc:SFRFieldDef edc:cname="ALWAYS1" edc:nzwidth="0x1" edc:desc="Always Written to One"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SEFC1" edc:cname="EEFC_FCR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x460E0204">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SEFC1">
            <edc:SFRFieldDef edc:cname="FCMD" edc:nzwidth="0x8" edc:desc="Flash Command">
              <edc:SFRFieldSemantic edc:cname="GETD" edc:desc="Get Flash descriptor" edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="WP" edc:desc="Write page" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="WPL" edc:desc="Write page and lock" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="EPA" edc:desc="Erase pages (8, 16, 32, 64)" edc:when="(field &amp; 0xFF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="SLB" edc:desc="Set lock bit" edc:when="(field &amp; 0xFF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="CLB" edc:desc="Clear lock bit" edc:when="(field &amp; 0xFF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="GLB" edc:desc="Get lock bit" edc:when="(field &amp; 0xFF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="SGPB" edc:desc="Set GPNVM bit" edc:when="(field &amp; 0xFF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="CGPB" edc:desc="Clear GPNVM bit" edc:when="(field &amp; 0xFF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="GGPB" edc:desc="Get GPNVM bit" edc:when="(field &amp; 0xFF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="STUI" edc:desc="Start read unique identifier" edc:when="(field &amp; 0xFF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="SPUI" edc:desc="Stop read unique identifier" edc:when="(field &amp; 0xFF) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="GCALB" edc:desc="Get CALIB bit" edc:when="(field &amp; 0xFF) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="ES" edc:desc="Erase sector" edc:when="(field &amp; 0xFF) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="WUS" edc:desc="Write user signature" edc:when="(field &amp; 0xFF) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="EUS" edc:desc="Erase user signature" edc:when="(field &amp; 0xFF) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="STUS" edc:desc="Start read user signature" edc:when="(field &amp; 0xFF) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="SPUS" edc:desc="Stop read user signature" edc:when="(field &amp; 0xFF) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="SUSP" edc:desc="Suspend" edc:when="(field &amp; 0xFF) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="RES" edc:desc="Resume" edc:when="(field &amp; 0xFF) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="SCK" edc:desc="Send cryptographic key" edc:when="(field &amp; 0xFF) == 0x19"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FARG" edc:nzwidth="0x10" edc:desc="Flash Command Argument"/>
            <edc:SFRFieldDef edc:cname="FKEY" edc:nzwidth="0x8" edc:desc="Flash Writing Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="The 0x5A value enables the command defined by the bits in the register. If the field is written with a different value, the write is not performed and no action is started." edc:when="(field &amp; 0xFF) == 0x5A"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SEFC1" edc:cname="EEFC_FSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrr----------rrrrrr" edc:impl="0xFF003F" edc:_addr="0x460E0208">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SEFC1">
            <edc:SFRFieldDef edc:cname="FRDY" edc:nzwidth="0x1" edc:desc="Flash Ready Status (cleared when Flash is busy)"/>
            <edc:SFRFieldDef edc:cname="FCMDE" edc:nzwidth="0x1" edc:desc="Flash Command Error Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="FLOCKE" edc:nzwidth="0x1" edc:desc="Flash Lock Error Status (cleared on read or by writing EEFC_FCR)"/>
            <edc:SFRFieldDef edc:cname="FLERR" edc:nzwidth="0x1" edc:desc="Flash Error Status (cleared when a programming operation starts)"/>
            <edc:SFRFieldDef edc:cname="WPERR" edc:nzwidth="0x1" edc:desc="Write Protection Error Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="FLSUSP" edc:nzwidth="0x1" edc:desc="Flash Suspended Status (cleared when resuming the programming operation)"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="SECCELSBD" edc:nzwidth="0x1" edc:desc="Single ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="MECCELSBD" edc:nzwidth="0x1" edc:desc="Multiple ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SECCEMSBD" edc:nzwidth="0x1" edc:desc="Single ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="MECCEMSBD" edc:nzwidth="0x1" edc:desc="Multiple ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SECCELSBL" edc:nzwidth="0x1" edc:desc="Single ECC Error on LSB Part of the Memory Lock Bits"/>
            <edc:SFRFieldDef edc:cname="MECCELSBL" edc:nzwidth="0x1" edc:desc="Multiple ECC Error on LSB Part of the Memory Lock Bits"/>
            <edc:SFRFieldDef edc:cname="SECCEMSBL" edc:nzwidth="0x1" edc:desc="Single ECC Error on MSB Part of the Memory Lock Bits"/>
            <edc:SFRFieldDef edc:cname="MECCEMSBL" edc:nzwidth="0x1" edc:desc="Multiple ECC Error on MSB Part of the Memory Lock Bits"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SEFC1" edc:cname="EEFC_FRR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x460E020C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SEFC1">
            <edc:SFRFieldDef edc:cname="FVALUE" edc:nzwidth="0x20" edc:desc="Flash Result Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SEFC1" edc:cname="EEFC_USR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x460E0210">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SEFC1">
            <edc:SFRFieldDef edc:cname="RDENUSB0" edc:nzwidth="0x1" edc:desc="Read Enable for User Signature Block 0"/>
            <edc:SFRFieldDef edc:cname="RDENUSB1" edc:nzwidth="0x1" edc:desc="Read Enable for User Signature Block 1"/>
            <edc:SFRFieldDef edc:cname="RDENUSB2" edc:nzwidth="0x1" edc:desc="Read Enable for User Signature Block 2"/>
            <edc:SFRFieldDef edc:cname="RDENUSB3" edc:nzwidth="0x1" edc:desc="Read Enable for User Signature Block 3"/>
            <edc:SFRFieldDef edc:cname="RDENUSB4" edc:nzwidth="0x1" edc:desc="Read Enable for User Signature Block 4"/>
            <edc:SFRFieldDef edc:cname="RDENUSB5" edc:nzwidth="0x1" edc:desc="Read Enable for User Signature Block 5"/>
            <edc:SFRFieldDef edc:cname="RDENUSB6" edc:nzwidth="0x1" edc:desc="Read Enable for User Signature Block 6"/>
            <edc:SFRFieldDef edc:cname="RDENUSB7" edc:nzwidth="0x1" edc:desc="Read Enable for User Signature Block 7"/>
            <edc:SFRFieldDef edc:cname="WRENUSB0" edc:nzwidth="0x1" edc:desc="Write Enable for User Signature Block 0"/>
            <edc:SFRFieldDef edc:cname="WRENUSB1" edc:nzwidth="0x1" edc:desc="Write Enable for User Signature Block 1"/>
            <edc:SFRFieldDef edc:cname="WRENUSB2" edc:nzwidth="0x1" edc:desc="Write Enable for User Signature Block 2"/>
            <edc:SFRFieldDef edc:cname="WRENUSB3" edc:nzwidth="0x1" edc:desc="Write Enable for User Signature Block 3"/>
            <edc:SFRFieldDef edc:cname="WRENUSB4" edc:nzwidth="0x1" edc:desc="Write Enable for User Signature Block 4"/>
            <edc:SFRFieldDef edc:cname="WRENUSB5" edc:nzwidth="0x1" edc:desc="Write Enable for User Signature Block 5"/>
            <edc:SFRFieldDef edc:cname="WRENUSB6" edc:nzwidth="0x1" edc:desc="Write Enable for User Signature Block 6"/>
            <edc:SFRFieldDef edc:cname="WRENUSB7" edc:nzwidth="0x1" edc:desc="Write Enable for User Signature Block 7"/>
            <edc:SFRFieldDef edc:cname="PRIVUSB0" edc:nzwidth="0x1" edc:desc="Privileged Access for User Signature Block 0"/>
            <edc:SFRFieldDef edc:cname="PRIVUSB1" edc:nzwidth="0x1" edc:desc="Privileged Access for User Signature Block 1"/>
            <edc:SFRFieldDef edc:cname="PRIVUSB2" edc:nzwidth="0x1" edc:desc="Privileged Access for User Signature Block 2"/>
            <edc:SFRFieldDef edc:cname="PRIVUSB3" edc:nzwidth="0x1" edc:desc="Privileged Access for User Signature Block 3"/>
            <edc:SFRFieldDef edc:cname="PRIVUSB4" edc:nzwidth="0x1" edc:desc="Privileged Access for User Signature Block 4"/>
            <edc:SFRFieldDef edc:cname="PRIVUSB5" edc:nzwidth="0x1" edc:desc="Privileged Access for User Signature Block 5"/>
            <edc:SFRFieldDef edc:cname="PRIVUSB6" edc:nzwidth="0x1" edc:desc="Privileged Access for User Signature Block 6"/>
            <edc:SFRFieldDef edc:cname="PRIVUSB7" edc:nzwidth="0x1" edc:desc="Privileged Access for User Signature Block 7"/>
            <edc:SFRFieldDef edc:cname="LOCKUSRB0" edc:nzwidth="0x1" edc:desc="Lock User Signature Rights for User Signature Block 0"/>
            <edc:SFRFieldDef edc:cname="LOCKUSRB1" edc:nzwidth="0x1" edc:desc="Lock User Signature Rights for User Signature Block 1"/>
            <edc:SFRFieldDef edc:cname="LOCKUSRB2" edc:nzwidth="0x1" edc:desc="Lock User Signature Rights for User Signature Block 2"/>
            <edc:SFRFieldDef edc:cname="LOCKUSRB3" edc:nzwidth="0x1" edc:desc="Lock User Signature Rights for User Signature Block 3"/>
            <edc:SFRFieldDef edc:cname="LOCKUSRB4" edc:nzwidth="0x1" edc:desc="Lock User Signature Rights for User Signature Block 4"/>
            <edc:SFRFieldDef edc:cname="LOCKUSRB5" edc:nzwidth="0x1" edc:desc="Lock User Signature Rights for User Signature Block 5"/>
            <edc:SFRFieldDef edc:cname="LOCKUSRB6" edc:nzwidth="0x1" edc:desc="Lock User Signature Rights for User Signature Block 6"/>
            <edc:SFRFieldDef edc:cname="LOCKUSRB7" edc:nzwidth="0x1" edc:desc="Lock User Signature Rights for User Signature Block 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SEFC1" edc:cname="EEFC_KBLR" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x460E0214">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SEFC1">
            <edc:SFRFieldDef edc:cname="KBTLUSB0" edc:nzwidth="0x1" edc:desc="Key Bus Transfer Lock from User Signature Block 0"/>
            <edc:SFRFieldDef edc:cname="KBTLUSB1" edc:nzwidth="0x1" edc:desc="Key Bus Transfer Lock from User Signature Block 1"/>
            <edc:SFRFieldDef edc:cname="KBTLUSB2" edc:nzwidth="0x1" edc:desc="Key Bus Transfer Lock from User Signature Block 2"/>
            <edc:SFRFieldDef edc:cname="KBTLUSB3" edc:nzwidth="0x1" edc:desc="Key Bus Transfer Lock from User Signature Block 3"/>
            <edc:SFRFieldDef edc:cname="KBTLUSB4" edc:nzwidth="0x1" edc:desc="Key Bus Transfer Lock from User Signature Block 4"/>
            <edc:SFRFieldDef edc:cname="KBTLUSB5" edc:nzwidth="0x1" edc:desc="Key Bus Transfer Lock from User Signature Block 5"/>
            <edc:SFRFieldDef edc:cname="KBTLUSB6" edc:nzwidth="0x1" edc:desc="Key Bus Transfer Lock from User Signature Block 6"/>
            <edc:SFRFieldDef edc:cname="KBTLUSB7" edc:nzwidth="0x1" edc:desc="Key Bus Transfer Lock from User Signature Block 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xCC" edc:_addr="0x460E0218"/>
      <edc:SFRDef ltx:memberofperipheral="SEFC1" edc:cname="EEFC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn--nnnnn" edc:impl="0xFFFFFF9F" edc:_addr="0x460E02E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SEFC1">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:SFRFieldDef edc:cname="GPNVMWP" edc:nzwidth="0x1" edc:desc="GPNVM Bit Write Protection"/>
            <edc:SFRFieldDef edc:cname="LOCKWP" edc:nzwidth="0x1" edc:desc="Lock Bit Write Protection"/>
            <edc:SFRFieldDef edc:cname="ERASEWP" edc:nzwidth="0x1" edc:desc="Erase and Write Protection"/>
            <edc:SFRFieldDef edc:cname="USRWP" edc:nzwidth="0x1" edc:desc="User Signature Write Protection"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ERASEWL" edc:nzwidth="0x1" edc:desc="Erase and Write Lock"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x454643"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x71FD18" edc:_addr="0x460E02E8"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SCER" edc:nzwidth="0x20" edc:access="--------wwww--w-----wwww--------" edc:impl="0xF20F00" edc:_addr="0x46800000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:nzwidth="0x1" edc:desc="Programmable Clock 0 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:nzwidth="0x1" edc:desc="Programmable Clock 1 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:nzwidth="0x1" edc:desc="Programmable Clock 2 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:nzwidth="0x1" edc:desc="Programmable Clock 3 Output Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CPBMCK" edc:nzwidth="0x1" edc:desc="Coprocessor Bus Master Clocks Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CPKEY" edc:nzwidth="0x4" edc:desc="Coprocessor Clocks Enable Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="This field must be written to 0xA to validate CPBMCK and CPCK." edc:when="(field &amp; 0xF) == 0x0A"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SCDR" edc:nzwidth="0x20" edc:access="--------wwww--w-----wwww--------" edc:impl="0xF20F00" edc:_addr="0x46800004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:nzwidth="0x1" edc:desc="Programmable Clock 0 Output Disable"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:nzwidth="0x1" edc:desc="Programmable Clock 1 Output Disable"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:nzwidth="0x1" edc:desc="Programmable Clock 2 Output Disable"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:nzwidth="0x1" edc:desc="Programmable Clock 3 Output Disable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CPBMCK" edc:nzwidth="0x1" edc:desc="Coprocessor Bus Master Clocks Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CPKEY" edc:nzwidth="0x4" edc:desc="Coprocessor Clocks Enable Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="This field must be written to 0xA to validate CPBMCK and CPCK." edc:when="(field &amp; 0xF) == 0x0A"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SCSR" edc:nzwidth="0x20" edc:access="--------------r-----rrrr------rr" edc:impl="0x20F03" edc:_addr="0x46800008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CPU_CLK0S" edc:nzwidth="0x1" edc:desc="CPU_CLK Status for Core 0"/>
            <edc:SFRFieldDef edc:cname="CPU_CLK1S" edc:nzwidth="0x1" edc:desc="CPU_CLK Status for Core 1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:nzwidth="0x1" edc:desc="Programmable Clock 0 Output Status"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:nzwidth="0x1" edc:desc="Programmable Clock 1 Output Status"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:nzwidth="0x1" edc:desc="Programmable Clock 2 Output Status"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:nzwidth="0x1" edc:desc="Programmable Clock 3 Output Status"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CPBMCK" edc:nzwidth="0x1" edc:desc="Coprocessor Bus Master Clocks Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PLL_CTRL0" edc:nzwidth="0x20" edc:access="nnnnn-------nnnnnnnn----nnnnnnnn" edc:impl="0xF80FF0FF" edc:_addr="0x4680000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="DIVPMC0" edc:nzwidth="0x8" edc:desc="Divider for PMC output 0"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DIVPMC1" edc:nzwidth="0x8" edc:desc="Divider for PMC output 1 (PLLA only)"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PLLMS" edc:nzwidth="0x1" edc:desc="PLL Multiplexer Select"/>
            <edc:SFRFieldDef edc:cname="ENPLL" edc:nzwidth="0x1" edc:desc="Enable PLL"/>
            <edc:SFRFieldDef edc:cname="ENPLLO0" edc:nzwidth="0x1" edc:desc="Enable PLL Clock Output 0"/>
            <edc:SFRFieldDef edc:cname="ENPLLO1" edc:nzwidth="0x1" edc:desc="Enable PLL Clock Output 1 (PLLA only)"/>
            <edc:SFRFieldDef edc:cname="ENLOCK" edc:nzwidth="0x1" edc:desc="Enable PLL Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
