Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_SCFG13" edc:nzwidth="0x20" edc:access="----------nnnnnn-------nnnnnnnnn" edc:impl="0x3F01FF" edc:_addr="0x4A000074">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:nzwidth="0x9" edc:desc="Maximum Bus Grant Duration for Masters"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:nzwidth="0x2" edc:desc="Default Master Type">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters. This results in a one clock cycle latency for the first access of a burst transfer or for a single access." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LAST" edc:desc="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it. This results in not having one clock cycle latency when the last master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FIXED" edc:desc="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field. This results in not having one clock cycle latency when the fixed master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:nzwidth="0x4" edc:desc="Fixed Default Master"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_SCFG14" edc:nzwidth="0x20" edc:access="----------nnnnnn-------nnnnnnnnn" edc:impl="0x3F01FF" edc:_addr="0x4A000078">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:nzwidth="0x9" edc:desc="Maximum Bus Grant Duration for Masters"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:nzwidth="0x2" edc:desc="Default Master Type">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters. This results in a one clock cycle latency for the first access of a burst transfer or for a single access." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LAST" edc:desc="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it. This results in not having one clock cycle latency when the last master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FIXED" edc:desc="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field. This results in not having one clock cycle latency when the fixed master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:nzwidth="0x4" edc:desc="Fixed Default Master"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_SCFG15" edc:nzwidth="0x20" edc:access="----------nnnnnn-------nnnnnnnnn" edc:impl="0x3F01FF" edc:_addr="0x4A00007C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="SLOT_CYCLE" edc:nzwidth="0x9" edc:desc="Maximum Bus Grant Duration for Masters"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DEFMSTR_TYPE" edc:nzwidth="0x2" edc:desc="Default Master Type">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters. This results in a one clock cycle latency for the first access of a burst transfer or for a single access." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LAST" edc:desc="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it. This results in not having one clock cycle latency when the last master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FIXED" edc:desc="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field. This results in not having one clock cycle latency when the fixed master tries to access the slave again." edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIXED_DEFMSTR" edc:nzwidth="0x4" edc:desc="Fixed Default Master"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX_PR0MATRIX2_PRAS" edc:nzwidth="0x20" edc:access="-nnn-nnn-nnn-nnn-nnn-nnn-nnn-nnn" edc:impl="0x77777777" edc:_addr="0x4A000080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x2" edc:desc="Master 0 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN0" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 0"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x2" edc:desc="Master 1 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN1" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x2" edc:desc="Master 2 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN2" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x2" edc:desc="Master 3 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN3" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x2" edc:desc="Master 4 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN4" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x2" edc:desc="Master 5 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN5" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 5"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x2" edc:desc="Master 6 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN6" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 6"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x2" edc:desc="Master 7 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN7" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
