Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX_PR12MATRIX2_PRBS" edc:nzwidth="0x20" edc:access="-nnn-nnn-nnn-nnn-nnn-nnn-nnn-nnn" edc:impl="0x77777777" edc:_addr="0x4A0000E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x2" edc:desc="Master 8 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN8" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 8"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:nzwidth="0x2" edc:desc="Master 9 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN9" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 9"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x2" edc:desc="Master 10 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN10" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 10"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:nzwidth="0x2" edc:desc="Master 11 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN11" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 11"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x2" edc:desc="Master 12 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN12" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 12"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:nzwidth="0x2" edc:desc="Master 13 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN13" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 13"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:nzwidth="0x2" edc:desc="Master 14 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN14" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 14"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:nzwidth="0x2" edc:desc="Master 15 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN15" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX_PR13MATRIX2_PRAS" edc:nzwidth="0x20" edc:access="-nnn-nnn-nnn-nnn-nnn-nnn-nnn-nnn" edc:impl="0x77777777" edc:_addr="0x4A0000E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x2" edc:desc="Master 0 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN0" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 0"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x2" edc:desc="Master 1 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN1" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x2" edc:desc="Master 2 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN2" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x2" edc:desc="Master 3 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN3" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x2" edc:desc="Master 4 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN4" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x2" edc:desc="Master 5 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN5" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 5"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x2" edc:desc="Master 6 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN6" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 6"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x2" edc:desc="Master 7 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN7" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX_PR13MATRIX2_PRBS" edc:nzwidth="0x20" edc:access="-nnn-nnn-nnn-nnn-nnn-nnn-nnn-nnn" edc:impl="0x77777777" edc:_addr="0x4A0000EC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x2" edc:desc="Master 8 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN8" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 8"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:nzwidth="0x2" edc:desc="Master 9 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN9" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 9"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x2" edc:desc="Master 10 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN10" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 10"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:nzwidth="0x2" edc:desc="Master 11 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN11" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 11"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x2" edc:desc="Master 12 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN12" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 12"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:nzwidth="0x2" edc:desc="Master 13 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN13" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 13"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:nzwidth="0x2" edc:desc="Master 14 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN14" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 14"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:nzwidth="0x2" edc:desc="Master 15 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN15" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX_PR14MATRIX2_PRAS" edc:nzwidth="0x20" edc:access="-nnn-nnn-nnn-nnn-nnn-nnn-nnn-nnn" edc:impl="0x77777777" edc:_addr="0x4A0000F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x2" edc:desc="Master 0 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN0" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 0"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x2" edc:desc="Master 1 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN1" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x2" edc:desc="Master 2 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN2" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x2" edc:desc="Master 3 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN3" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x2" edc:desc="Master 4 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN4" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x2" edc:desc="Master 5 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN5" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 5"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x2" edc:desc="Master 6 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN6" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 6"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x2" edc:desc="Master 7 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN7" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX_PR14MATRIX2_PRBS" edc:nzwidth="0x20" edc:access="-nnn-nnn-nnn-nnn-nnn-nnn-nnn-nnn" edc:impl="0x77777777" edc:_addr="0x4A0000F4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x2" edc:desc="Master 8 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN8" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 8"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:nzwidth="0x2" edc:desc="Master 9 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN9" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 9"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x2" edc:desc="Master 10 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN10" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 10"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:nzwidth="0x2" edc:desc="Master 11 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN11" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 11"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x2" edc:desc="Master 12 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN12" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 12"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:nzwidth="0x2" edc:desc="Master 13 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN13" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 13"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:nzwidth="0x2" edc:desc="Master 14 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN14" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 14"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:nzwidth="0x2" edc:desc="Master 15 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN15" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX_PR15MATRIX2_PRAS" edc:nzwidth="0x20" edc:access="-nnn-nnn-nnn-nnn-nnn-nnn-nnn-nnn" edc:impl="0x77777777" edc:_addr="0x4A0000F8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x2" edc:desc="Master 0 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN0" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 0"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x2" edc:desc="Master 1 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN1" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x2" edc:desc="Master 2 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN2" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x2" edc:desc="Master 3 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN3" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x2" edc:desc="Master 4 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN4" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x2" edc:desc="Master 5 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN5" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 5"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x2" edc:desc="Master 6 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN6" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 6"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x2" edc:desc="Master 7 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN7" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX_PR15MATRIX2_PRBS" edc:nzwidth="0x20" edc:access="-nnn-nnn-nnn-nnn-nnn-nnn-nnn-nnn" edc:impl="0x77777777" edc:_addr="0x4A0000FC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x2" edc:desc="Master 8 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN8" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 8"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:nzwidth="0x2" edc:desc="Master 9 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN9" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 9"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x2" edc:desc="Master 10 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN10" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 10"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:nzwidth="0x2" edc:desc="Master 11 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN11" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 11"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x2" edc:desc="Master 12 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN12" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 12"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:nzwidth="0x2" edc:desc="Master 13 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN13" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 13"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:nzwidth="0x2" edc:desc="Master 14 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN14" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 14"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:nzwidth="0x2" edc:desc="Master 15 Priority"/>
            <edc:SFRFieldDef edc:cname="LQOSEN15" edc:nzwidth="0x1" edc:desc="Latency Quality of Service Enable for Master 15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_MRCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4A000100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="RCB0" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 0"/>
            <edc:SFRFieldDef edc:cname="RCB1" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 1"/>
            <edc:SFRFieldDef edc:cname="RCB2" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 2"/>
            <edc:SFRFieldDef edc:cname="RCB3" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 3"/>
            <edc:SFRFieldDef edc:cname="RCB4" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 4"/>
            <edc:SFRFieldDef edc:cname="RCB5" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 5"/>
            <edc:SFRFieldDef edc:cname="RCB6" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 6"/>
            <edc:SFRFieldDef edc:cname="RCB7" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 7"/>
            <edc:SFRFieldDef edc:cname="RCB8" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 8"/>
            <edc:SFRFieldDef edc:cname="RCB9" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 9"/>
            <edc:SFRFieldDef edc:cname="RCB10" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 10"/>
            <edc:SFRFieldDef edc:cname="RCB11" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 11"/>
            <edc:SFRFieldDef edc:cname="RCB12" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 12"/>
            <edc:SFRFieldDef edc:cname="RCB13" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 13"/>
            <edc:SFRFieldDef edc:cname="RCB14" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 14"/>
            <edc:SFRFieldDef edc:cname="RCB15" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x4A000104"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_SFR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4A000110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_SFR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4A000114">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register Fields"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
