Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_PASSR4" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4A000250">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_PASSR5" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4A000254">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_PASSR6" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4A000258">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_PASSR7" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4A00025C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_PASSR8" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4A000260">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_PASSR9" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4A000264">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_PASSR10" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4A000268">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_PASSR11" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4A00026C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_PASSR12" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4A000270">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_PASSR13" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4A000274">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_PASSR14" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4A000278">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_PASSR15" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4A00027C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_PRTSR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4A000280">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX2" edc:cname="MATRIX2_PRTSR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4A000284">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX2">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
