Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTG/edc/PIC32CX1025MTG64.PIC
      <edc:DCRDef ltx:memberofperipheral="LOCKBIT" edc:cname="LOCKBIT_WORD3" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xC">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="LOCKBIT">
            <edc:DCRFieldDef edc:cname="LOCK_REGION_96" edc:nzwidth="0x1" edc:desc="Lock Region 96">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_97" edc:nzwidth="0x1" edc:desc="Lock Region 97">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_98" edc:nzwidth="0x1" edc:desc="Lock Region 98">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_99" edc:nzwidth="0x1" edc:desc="Lock Region 99">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_100" edc:nzwidth="0x1" edc:desc="Lock Region 100">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_101" edc:nzwidth="0x1" edc:desc="Lock Region 101">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_102" edc:nzwidth="0x1" edc:desc="Lock Region 102">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_103" edc:nzwidth="0x1" edc:desc="Lock Region 103">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_104" edc:nzwidth="0x1" edc:desc="Lock Region 104">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_105" edc:nzwidth="0x1" edc:desc="Lock Region 105">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_106" edc:nzwidth="0x1" edc:desc="Lock Region 106">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_107" edc:nzwidth="0x1" edc:desc="Lock Region 107">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_108" edc:nzwidth="0x1" edc:desc="Lock Region 108">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_109" edc:nzwidth="0x1" edc:desc="Lock Region 109">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_110" edc:nzwidth="0x1" edc:desc="Lock Region 110">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_111" edc:nzwidth="0x1" edc:desc="Lock Region 111">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_112" edc:nzwidth="0x1" edc:desc="Lock Region 112">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_113" edc:nzwidth="0x1" edc:desc="Lock Region 113">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_114" edc:nzwidth="0x1" edc:desc="Lock Region 114">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_115" edc:nzwidth="0x1" edc:desc="Lock Region 115">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_116" edc:nzwidth="0x1" edc:desc="Lock Region 116">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_117" edc:nzwidth="0x1" edc:desc="Lock Region 117">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_118" edc:nzwidth="0x1" edc:desc="Lock Region 118">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_119" edc:nzwidth="0x1" edc:desc="Lock Region 119">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_120" edc:nzwidth="0x1" edc:desc="Lock Region 120">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_121" edc:nzwidth="0x1" edc:desc="Lock Region 121">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_122" edc:nzwidth="0x1" edc:desc="Lock Region 122">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_123" edc:nzwidth="0x1" edc:desc="Lock Region 123">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_124" edc:nzwidth="0x1" edc:desc="Lock Region 124">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_125" edc:nzwidth="0x1" edc:desc="Lock Region 125">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_126" edc:nzwidth="0x1" edc:desc="Lock Region 126">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_127" edc:nzwidth="0x1" edc:desc="Lock Region 127">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:LockbitsSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PA4" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM0_IO0" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA5" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM0_IO1" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM0"/>
      <edc:VirtualPin edc:name="WKUP5" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA6" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM0_IO2" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM0"/>
      <edc:VirtualPin edc:name="FLEXCOM0_IO4" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM0"/>
      <edc:VirtualPin edc:name="TIOA6" edc:ppsfunction="C" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM0_IO3" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM0"/>
      <edc:VirtualPin edc:name="TIOB6" edc:ppsfunction="C" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA8" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM1_IO0" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA9" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM1_IO1" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM1"/>
      <edc:VirtualPin edc:name="WKUP6" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM2_IO0" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM2_IO1" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM2"/>
      <edc:VirtualPin edc:name="WKUP7" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA23"/>
      <edc:VirtualPin edc:name="FLEXCOM5_IO1" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM5"/>
      <edc:VirtualPin edc:name="TCLK0" edc:ppsfunction="D" ltx:memberofperipheral="TC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM5_IO0" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM5"/>
      <edc:VirtualPin edc:name="TIOB0" edc:ppsfunction="D" ltx:memberofperipheral="TC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA25" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM6_IO0" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM6"/>
      <edc:VirtualPin edc:name="TIOA0" edc:ppsfunction="D" ltx:memberofperipheral="TC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA29" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM0_IO4" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM0"/>
      <edc:VirtualPin edc:name="FLEXCOM1_IO4" edc:ppsfunction="C" ltx:memberofperipheral="FLEXCOM1"/>
      <edc:VirtualPin edc:name="FLEXCOM2_IO4" edc:ppsfunction="D" ltx:memberofperipheral="FLEXCOM2"/>
      <edc:VirtualPin edc:name="AD0" edc:ppsfunction="X1" ltx:memberofperipheral="ACC"/>
      <edc:VirtualPin edc:name="ACC_INP0" edc:ppsfunction="X1" ltx:memberofperipheral="ACC"/>
      <edc:VirtualPin edc:name="XIN" edc:ppsfunction="X1" ltx:memberofperipheral="ACC"/>
      <edc:VirtualPin edc:name="AD0" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="ACC_INP0" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="XIN" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM3_IO4" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM3"/>
      <edc:VirtualPin edc:name="TIOB1" edc:ppsfunction="D" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="AD3" edc:ppsfunction="X1" ltx:memberofperipheral="ACC"/>
      <edc:VirtualPin edc:name="ACC_INN0" edc:ppsfunction="X1" ltx:memberofperipheral="ACC"/>
      <edc:VirtualPin edc:name="XOUT" edc:ppsfunction="X1" ltx:memberofperipheral="ACC"/>
      <edc:VirtualPin edc:name="AD3" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="ACC_INN0" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="XOUT" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB2" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO2" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM7"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO4" edc:ppsfunction="C" ltx:memberofperipheral="FLEXCOM7"/>
      <edc:VirtualPin edc:name="TIOA2" edc:ppsfunction="D" ltx:memberofperipheral="TC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB3" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO1" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM7"/>
      <edc:VirtualPin edc:name="TIOB2" edc:ppsfunction="D" ltx:memberofperipheral="TC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO0" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM7"/>
      <edc:VirtualPin edc:name="TCLK2" edc:ppsfunction="D" ltx:memberofperipheral="TC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB9" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM3_IO0" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM3"/>
      <edc:VirtualPin edc:name="WKUP9" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB10" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM3_IO1" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM3"/>
      <edc:VirtualPin edc:name="TRACESWO0" edc:ppsfunction="D" ltx:memberofperipheral="TPI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB11" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM3_IO2" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM3"/>
      <edc:VirtualPin edc:name="FLEXCOM3_IO4" edc:ppsfunction="C" ltx:memberofperipheral="FLEXCOM3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM3_IO3" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM3"/>
      <edc:VirtualPin edc:name="WKUP10" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB24" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM4_IO0" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM4"/>
      <edc:VirtualPin edc:name="TIOA5" edc:ppsfunction="C" ltx:memberofperipheral="TC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB25" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM4_IO1" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM4"/>
      <edc:VirtualPin edc:name="TIOB5" edc:ppsfunction="C" ltx:memberofperipheral="TC1"/>
      <edc:VirtualPin edc:name="WKUP8" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB26" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM4_IO2" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM4"/>
      <edc:VirtualPin edc:name="FLEXCOM4_IO4" edc:ppsfunction="C" ltx:memberofperipheral="FLEXCOM4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC0" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM4_IO3" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM4"/>
      <edc:VirtualPin edc:name="TIOA3" edc:ppsfunction="C" ltx:memberofperipheral="TC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC2" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM1_IO0" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC3" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM1_IO1" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC5" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="A" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="TCLK5" edc:ppsfunction="D" ltx:memberofperipheral="TC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC10" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="QIO3" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC11" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="QIO2" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO4" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC12" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="QIO1" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO1" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC13" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="QIO0" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO0" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC14" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="QCS" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO3" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM7"/>
      <edc:VirtualPin edc:name="TIOA7" edc:ppsfunction="D" ltx:memberofperipheral="TC2"/>
      <edc:VirtualPin edc:name="WKUP13" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC15" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="QSCK" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO2" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM7"/>
      <edc:VirtualPin edc:name="TIOB7" edc:ppsfunction="D" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC18" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM6_IO2" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM6"/>
      <edc:VirtualPin edc:name="FLEXCOM6_IO4" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM6"/>
      <edc:VirtualPin edc:name="TIOB8" edc:ppsfunction="D" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC19" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM6_IO3" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM6"/>
      <edc:VirtualPin edc:name="TCLK8" edc:ppsfunction="D" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC20" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO1" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM7"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC21" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="FLEXCOM7_IO0" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM7"/>
      <edc:VirtualPin edc:name="WKUP14" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC22" edc:ppsfunction="default" ltx:memberofperipheral="PIO0"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="A" ltx:memberofperipheral="PMC"/>
    </edc:Pin>
